{"rating": 1, "review": "These are super cute and useful. However, within less than 1 hour it had peeled and looked a mess. For the price of $10.19 this is surely not acceptable . I simply put it on the brand new Samsung dishwasher and when I wanted to turn it around it had more or less melted."}
{"rating": 1, "review": "too expensive for a small tube"}
{"rating": 1, "review": "One switch broke when installed. The other worked only for a few days and then failed. When you jiggle the button you can make it activate. Very cheap and fragile, not at all like the original part. Looking for another brand to try."}
{"rating": 1, "review": "We bought this GE induction range (30\" Profile, slide-in) in Oct of 2013 and it still (middle of October 2014) is not working properly! To be specific: the large \"burner\" heats/cooks water/food slower than the small burners do.  It took quite tow different GE repair men to try and fix problem. They both ordered parts to have the parts come in damaged. Its now a year later and finally the GE repair man replaced the burners and board. After trying back to square one, the large burner is still slower than the others. I have concluded its just a bad stove with bad service and a bad company. Very very unsatisfied with every aspect of GE quality control and slow inadequate  responses. have a fully functional range."}
{"rating": 1, "review": "Not usually one to complain about price in a review because I've always thought, \"if you don't like the price, then why'd you buy it?\".  I mean, it's not like you bought it and then found out later how much it cost, right?\n  Well, I bought this because I thought it was doing more than it does.  Recently I bought a total dissolved solids (TDS) meter and tested our water before and after the filter a few days after putting a new one in.  Maybe I was expecting too much, but knocking the TDS down from 121 city water to 86 filtered was underwhelming.  Nope, did not feel whelmed in the least.\n  For the price of a year's supply of these, you can get an external filter that will knock TDS down to single digits.  And if all you're using it for is the fridge, like this is for, then it'll last you a lot longer.  This is way overpriced for what it does and I've just ordered a RO/DI system so I don't have to buy another."}
{"rating": 1, "review": "So, so disappointed I threw away the box before trying this product. Not impressed and wish I could return it for my money back. I thought this would be an easy way to dry and style hair on one step. It would take FOREVER to use this styling product to dry all of your hair. Total waste of money. I tried this item today since I just received it last night. My hair was almost dry and it still took forever. It does not style your hair well. Will not be using this item again."}
{"rating": 1, "review": "I wanted to post this to people who are buying the black/white of this style handle  and they  KEEP BREAKING.  I cannot guarantee that these will fit everyone's  Frid. fridge, but try the steel handles:  Frigidaire 242075501 Refrigerator Door Handle.  The price range online is from $66-$127 at diff sites.  I got mine for approx $88.  I know this is a lot, but it beats buying these cheap plastic handles over and over.  My fridge is black and the steel is silver. It does not match but looks kinda cool.  I broke the originals on fridge and I just broke the replacement black pair.  To me, if Frigidaire would increase the price and put a better quality handle, it would save a lot of customer frustration.  We have a tan Frigidaire fridege in our mailroom at work.  The fridge is over 10 years old and so far (knock on wood) the plastic handles have not broke.  That goes to show you that a decade ago Frigidaire was using higher quality handles on their refrigerators."}
{"rating": 1, "review": "Did not fit right.  Slid off."}
{"rating": 1, "review": "very cheap"}
{"rating": 1, "review": "The Engineering of the Ice Maker in the Frigidaire Gallery w/\"French Doors\" is the poorest design on the market.  It may or may not fail Year 1 but it will fail in the future!  I purchased the best Refrigerator Frigidaire / Electrolux makes which is this very Gallery Series Refrigerator and it is going to cost me 64% of my purchase price to fix a defective Ice Maker. In talking to the customer care corporate manager, they will only cover 30% or the repair cost 1+ years after purchase.  This is a company that in Feb 10, 2016 LOST a class action suit on this very problem. ( [...]) The Customer care manager states they will not cover any defects post manufactures warranty, and because this defective device does not cause harm to health or well-being, NO RECALL will be issued.  My only option is SEVERELY WARN YOU NOT TO BUY THIS PRODUCT!!!\n\nIn less than 5 years this Refrigerator will cost you in the upwards of $900.00 and tons of frustration to get fixed.\n\nhttp://www.amazon.com/Frigidaire-Gallery-FGHB2844LF-Refrigerator-Stainless/product-reviews/B0041J411K"}
{"rating": 1, "review": "I made this purchase as an emergency purchase because my breast milk in my freezer was defrosting due to my freezer breaking down so I needed this mini freezer immediately and fast! When it arrived I was relieved but when I opened it, the top was damaged.. I was devastated because even though I paid full price, I can't return it, I'm desperate for a freezer or I lose over 90 ounces of breast milk, so so disappointed you have no idea! I truly should be getting some type of refund."}
{"rating": 1, "review": "Pretty freaking irritated. Got this belt very quickly, got it installed, and it broke!! Not very happy with this product at all!!!"}
{"rating": 1, "review": "I really should have bought a shorter hose.  :(  Having this long of a hose put a kink it in when I pushed the dryer against the wall which ended up messing up my dryer.  It stopped working. Thank goodness it was still under warranty and they fixed it.  This time I was very careful about the hose and cut it down to the correct size."}
{"rating": 1, "review": "Does not come with handle and handle from original does not fit"}
{"rating": 1, "review": "After reading the reviews, I bought this frig.  To my disappointment, it does not have tempered glass shelving. It also does not have clear freezer door which sold me on this product. I'm wondering if this is even the same refrigerator."}
{"rating": 1, "review": "Poor quality switch.  Quit working in about two weeks."}
{"rating": 1, "review": "Does not remove all the chemical taste from the water like the actual GE filters do.  There is a reason why the GE filters cost more and next time I will pay the extra for the better filter.  I would not purchase this again."}
{"rating": 1, "review": "This handle us much smaller than the original handle it should replace.  It was returned.  It would be helpful to have the refrigerator models listed that it fits."}
{"rating": 1, "review": "I ordered the replacement filters for my LG fridge and received filters for Samsung.  I notified seller and also send a picture of what they sent me. They replied that these are replacement filters and they can fit multiple brands.  Didn't make any sense to me but I went ahead and tried using a Samsung filter on a LG fridge.  The filter was smaller and didn't even have the same locking mechanism  and at this point I decided to send back the item for a refund.  Returning item was easy as seller sent me a prepaid shipping label.  I didn't want to deal with them sending me the correct item since I lost faith in their staff on the knowledge of their own products .  I buy the factory made filters instead even if it cost a bit more since I feel the time wasted was not worth the savings"}
{"rating": 1, "review": "Would not buy again.  Kids complained of bad taste compared to real filters.  I also had to change the filter after only 2 weeks.  In a clear glass pieces were floating around.  Tried second glass...still floating stuff.  Sink faucet clear.  Filter #2 working ok...water clear."}
{"rating": 1, "review": "So suck, I use first wash, spin its all good. Then second wash is work. Spin don't work. I try long time. Still not work"}
{"rating": 1, "review": "Tasted like plastic"}
{"rating": 1, "review": "states that this guy goes with PN# WB06X10288;  however they are 5mm wider than original, simply does not physically fit even if one would attempt to force it in"}
{"rating": 1, "review": "worst stove I have ever used in my life. (I am a chef and know all kinds of stoves)\nThe knobs do not light properly no matter how you adjust them. They also get dangerously hot when oven is used.\nThe oven is difficult to light: you see the flame, turn it to temperature and then it mysteriously turns off in middle of cooking.\nThe oven temperature is no where near the real temperature (have tested it with oven temperatures)\nThis is a cheap, poorly made product."}
{"rating": 1, "review": "I bought a six-pack of these wicks because, even though we have a water softener, we always seem to get a mineral build up on the wicks, and since we go through several each season, I thought these would be more economical.  Unfortunately, they don't last as long as the other more expensive brand.  We are only getting about one week out of each of these before the top part gets a build up, and then dries out so the humidifier doesn't function well.  I followed other reviewers' suggestions and soaked the wick in a vinegar water solution, but that only extended the life another few days. With the other brand, I usually got at least three weeks out of each wick.  Disappointed.  I would love it if someone would invent a wick made from cotton that you could toss in the washer."}
{"rating": 1, "review": "The machine still does not work properly."}
{"rating": 1, "review": "the fridge itself is very nice. It broke after 1,5 years. Upon calling the customer service I was informed that the warranty is 1 year only while in fact it is 2 years. After having a specialist take a look, which took a week to reserve, I was finally informed that the warranty will cover. Fast forward another 4 weeks!, the new fridge was dropped in front of my house leaving me to deal with bringing it in, installing and taking the old one out. Not the kind of service you expect for a $2K fridge."}
{"rating": 1, "review": "Expensive & I had to get another size to fit my one burner."}
{"rating": 1, "review": "The product that arrived was not what was listed on the description page. The wheels that go into the rails in the dishwasher were completely wrong. Please see attached photo to understand what I mean."}
{"rating": 1, "review": "Got this product in the morning through usps, it worked for two minutes when i fixed and after an hour I tried to dry my clothes and turned on the machine, this thing never worked after that, worst seller,"}
{"rating": 1, "review": "Don't dry quick at all and makes towels hard"}
{"rating": 1, "review": "WAY TO EXPENSIVE! LASTS MAYBE 3 WEEKS BEFORE IT BEGINS TO STINK!"}
{"rating": 1, "review": "Arrived broken and no slide for the front"}
{"rating": 1, "review": "Haven't used it much yet, but looks nice when perfectly clean, but shows up everything, so it will often not look very nice. The PRIMARY issue is that its measurements are stated WRONGLY!!!\n\nI looked all over for something which both showed its cutout and the top of the cooktops measurements would fit where my old cooktop was.  This one was ADVERTISED to fit the bill at 29 3/4\" x 21 1/2.  OOOOOOOPPPPPSSS!!!!!!!!!  It is only 21 inches rather than 21 1/2, so rather than overlapping my cutout by a 1/4\" on both sides, I have a GAP.  Ggggrrrrr!!!!!!!!!!!!!!"}
{"rating": 1, "review": "was the wrong element for what i needed and be aware, if you don't return it in 30 days its yours"}
{"rating": 1, "review": "Water would not flow through once filter was replaced with the one ordered. Ended up throwing in trash and purchasing original."}
{"rating": 1, "review": "Did not fit properly"}
{"rating": 1, "review": "Arrived damaged!"}
{"rating": 1, "review": "There is no where showed NSF certified on this product, and I think the description is not correct, please remove it."}
{"rating": 1, "review": "The part didn't fit, so I basically tossed it in the trash.  Waste of time and money. Makes me wonder if part was indeed a \"genuine\" Viking part."}
{"rating": 1, "review": "If you need to install a screen washer into the hose for your machine connection, this does not work (not enough relief in the coupling/hose end to accept the screen, even after removing the existing gasket)."}
{"rating": 1, "review": "Totally bummed! I thought this was also a humidifier which it is not"}
{"rating": 1, "review": "Took a while to get.  Didn't \"fix\" the issue. NO INSTRUCTIONS.  We had to Youtube how to install. The instructions were \"remove old, put in new\" . Well duh!  The box said return to repairs so not sure if the item I received is even a working part.  My washer keeps saying it's not locked so it won't cycle. I think I just blew $60."}
{"rating": 1, "review": "I am returning this item because it big and bulky.  Not to mention that it makes so few ice.  The little ice tray is a joke."}
{"rating": 1, "review": "If you landed here looking for something to jumpstart the compressor on your Kenmore 106 model, you don't want to order this part. Get the Whirlpool 2319792 Start Device instead."}
{"rating": 1, "review": "Returning this item due to the size of it.  Albeit knowing the overall dimensions at the time of ordering, when received, the case/housing makes this thing look huge and bulky."}
{"rating": 1, "review": "It blew up when I started to screw it in.  The glass turned a metallic grey.  Now the threaded end is screwed into the light socket not sure how to get it out."}
{"rating": 1, "review": "This a replacement for a previous version. The old one did a good job, but this one leaves most of the bad taste that North Texas water is infamous for."}
{"rating": 1, "review": "Large o-ring was dry rotted or defective and tore as I was installing. Water all over the inside of refrigerator. I was able to use the o-ring from the old filter. You get what you pay for."}
{"rating": 1, "review": "Two of the pans came out of the box with chipped enamel. I sent them back and the next ones came in chipped. Terrible quality!!"}
{"rating": 1, "review": "I just needed something at the top of my Dishwasher to keep it from tipping out.  Thought it would be simple, but this kit did not have what I needed.  It looked like it would work, but the slips in the kit did not fit the purpose.  Not worth sending back.  I'm still looking."}
{"rating": 1, "review": "I installed this 1 week ago. The installation was easy and straightforward.  Tonight, there was a puddle in front if the freezer again. I will never buy another Whirlpool again.  My hardwood floors are ruined. Who's ready for a class action lawsuit?"}
{"rating": 1, "review": "If you buy this piece of junk, beware: the lights are halogen bulbs that get so hot a drop of water makes them blow out. They cost $7.00 each (at least). The company gives you a suction cup to remove and replace the bulbs - it is a nightmare to use! If you mistakenly touch a blown bulb when the unit is on, you will lose the skin on your fingertip - I did. Do NOT buy any unit with recessed halogen bulbs with insertion prongs. You will live to regret it."}
{"rating": 1, "review": "Paid a lot of money for the Dacor Ovens believing that it would be worth it to have the high quality. I can say that of all the appliances I've owned these ovens are the worst. If I use the self-cleaning feature the ovens will not work afterwards. I learned from the repairmen how to take the control panel apart and reset everything but that is certainly not what I'd recommend as an acceptable \"feature\" in ovens. I do this only to save the hundreds of dollars in repair bills it otherwise cost. The ovens looked good when I bought them but the materials are certainly not what you'd expect to find on a quality appliance. I didn't realize the door handles were \"plastic\" until they began crumbling apart due to heat exposure. Even the screw-holes that hold the handles in place are plastic. When the oven is on it heats the door and the metal screws that hold it in place. This causes the plastic around it to melt and it soon disintegrates. This is just one of the problems with the handles. If you own Dacor ovens you will have to replace the handles with the same junk as before and like ever other part, they are expensive. These ovens are a huge disappointment and a purchase I sincerely wish I'd never made. I honestly don't know what brand is the best but with great conviction I can assure you it is not a Dacor."}
{"rating": 1, "review": "2 out of 3 leaks"}
{"rating": 1, "review": "I bought this exhaustn fan in November of 2011. It started malfunctioning soon after.  This thing is a fire hazard.  It will turn itself on and change your settings like crazy. I had to disconnect the power to it for safety.  I have been in contact with the seller for months.  Its now December 2012! I have recieved no replacement parts. The seller is not to be trusted!!"}
{"rating": 1, "review": "I bought a Frigidaire Wall oven. I had my old wall oven for years and years when it began to have problems...I mean it was years old. I paid well over a thousand dollars for the new Frigidaire. Reputable company, right? so I didn't buy an extended warrantee. BAD MOVE. I've had the unit for about 2.5 years. It no longer works and Frigidaire refuses to do anything about it. The igniter stopped working, the digital clock-oven temp is losing it's numbers. The unit gets so hot at the top that I have to use a potholder to turn it off, and it needs a new connection at the gas line. The repair estimate, without the digital oven temp is over $600. That would make this oven that is not a good oven to begin with, cost nearly two thousand dollars. I'm old, retired, and on a fixed income. I was stretching it to even purchase this unit. Now I have no oven at all.  There goes the Thanksgiving dinner. Thanks Frigidaire. I will never purchace another one of your products and advize all others to do the same."}
{"rating": 1, "review": "Was ok for a ice maker - it builds up a slime and Im not sure you can clean out everything and then after a year it just stopped working so didn't last. We only used it periodically for the first 8 months then more after and it didn't last. Wont buy it again"}
{"rating": 1, "review": "Shipping box was undamaged but product was damaged. Appear to be factory second or returns. Wash machine is still not working. Bad / faulty parts."}
{"rating": 1, "review": "Just received these replacement shelves. One was completely broken down the ride side and they are noticeably thinner and cheaper than the originals in my fridge."}
{"rating": 1, "review": "It wasn't until I got this installed that I realized that it would not work with the bin it came with (in my refrigerator model) or with the bin that came with my refrigerator model.  with the bin that came with my fridge, I can't close the door with the ice maker in stalled. The bin that came with this won't even fit in my refrigerator model (which is a GE model).  I will sooner take the loss of $90 bucks than to go to the trouble of trying to return this.  But I am going to have to go out and buy the IM-4A ice maker -- the one this model was supposed to improve on."}
{"rating": 1, "review": "Ice actuator was bent. Product was not made by GE, despite the description so stating.\nReturned because of bent actuator arm."}
{"rating": 1, "review": "Absolutely would not work in my Jenn-Air fridge.  Actually tired with and without the gasket and ended up with water spraying all over the inside of my fridge.  Since it was so cheap I just threw it away and went back to paying more for one from Pure"}
{"rating": 1, "review": "Didn't fit"}
{"rating": 1, "review": "Doesn't fit on our GE Profile fridge"}
{"rating": 1, "review": "Crap..."}
{"rating": 1, "review": "Bought 1st switch to replace one that would not regulate temperature.  Item was fulfilled by Amazon.  Installed and did not work.  Burner would not come on at all.  Removed and observed that contacts inside switch did not mate and connect like they were supposed to (this still worked on the old switch).  Ordered replacement from Amazon.  Checked replacement before installing and it looked to have the same problem.  Installed anyway to check.  Same result.  No burner operation.\n\nWent to local appliance supply.  Observed their in stock switch and contacts operated as they were supposed to.  Same switch in same bag and same supplier name (Robertshaw).  Had to pay way more than the Amazon price and a 20 mile trip, but it works.  Local appliance supply person suggested that the Amazon switch might be a knock-off product (both switches had the same printing on them).  Seems somewhat plausible as I cannot imagine that a decent manufacturer would let any switch go out without a test for basic functionality.  Two bad switches in a row does not seem coincidental.  It would be a shame if Amazon was selling items that were sub-standard as the real thing.  I'll probably never know if the products were legit and just part of a bad batch or something else.  Sending 2nd switch back to Amazon for refund."}
{"rating": 1, "review": "This is a horrible filter. The water taste is really bad even after two weeks!"}
{"rating": 1, "review": "Less than a year and it just stopped working..."}
{"rating": 1, "review": "Showed up, didn't work, Abt Electronics policy of 100% satisfaction is false, now all these months later, the guy shows up to fix it and can't.  I will never buy an appliance online ever again."}
{"rating": 1, "review": "Sucky"}
{"rating": 1, "review": "cracked and spayed water everywhere first time I used it"}
{"rating": 1, "review": "This item arrived inoperable. It is stuck on 10 just like the other complaints from customers. Will not buy from this seller again"}
{"rating": 1, "review": "i should have read the 1 star reviews, i have the same problem as the others; filter fits and seats correctly, but leaks into the drawer below. I removed the filter multiple times and seem to have it in place now, but based on the other review, it sounds as if it a temporary fix. I plan to order a Samsung OEM filter and replace this one."}
{"rating": 1, "review": "Flimsy. Harder to stain than chrome ones but these are legitimately flimsy."}
{"rating": 1, "review": "No stars. Valve in description is different then the valve you recieve. Also no or in seal was included. The valve was in a zip lock sandwich bag. I'm furious. My fridge will be dead another week and I will not purchase from this supplier again."}
{"rating": 1, "review": "The filter is leaking and I can't find a contact number for the company, so I'm frustrated."}
{"rating": 1, "review": "The heating element is not aligned with the pot placement indicating circle. Of course, I couldn't see this until I installed the unit. This should have NEVER left GEs factory. Thanks GE for such poor quality control and for wasting my time. Returned for another brand. Stay away from GE."}
{"rating": 1, "review": "THIS ITEM IS DEFECTIVE IT LEAKS THE WATER OUT OF THE CONTAINER IT GOES IN.."}
{"rating": 1, "review": "Do not buy from Ice-Machine-Supply.  Original pump lasted over 10 years, while the replacement looked OEM only lasted 10 *months*.  I have ordered a replacement from a different supplier.  Looks like I should have just paid LG for a true OEM part the first time.\n\nUpdate:  Ordered a replacement in Feb 2017 and that failed in Oct 2017.  The replacement looked legit (LG branding on the box).  It must be a knockoff.  There is no way that a replacement pump lasts 6 months while the original lasts 10 years"}
{"rating": 1, "review": "I bought this Feb. 2016 and it went out about a week ago. This product did not last as long as I would imagine. Needless to say, I lost 100s of dollars in frozen items. I'm very disappointed. I will be searching for a different brand."}
{"rating": 1, "review": "Could not use it. The Air-O-Swiss unit failed after one season. Not the cartridge's problem."}
{"rating": 1, "review": "I ordered this panel only to have it arrive irreparably bent at two corners.  I returned it for a full refund and will seek out another backsplash. The product itself \"is what it is\" - a simple piece of stainless steel.  The finish looked fine, but those wanting a sophisticated look at low expense will not find it here.  The panel will require trimming along the edges to blend it in to surrounding cabinetry. Mounting will also require your own set of screws (and difficult to match the finish) and would entail using liquid nails to make sure the panel remains flush to the wall between stove top and cabinet bottom. Any warping will leave a gap between the wall and the panel."}
{"rating": 1, "review": "Does not protect as it's supposed to. Even more work to clean, since you have to clean the sheets and the stove..."}
{"rating": 1, "review": "Just wanted to report a possible safety concern regarding this product that I purchased a little over a year ago. While switching out propane tanks, I noticed a few cracks in the hose, and can smell the odor of propane emanating through the cracks. I haven't been taking the tree of the tank very often since I leave it on there all the time to cook with the grill on the porch. Only time it was taken off the tank was when we went camping last summer. I called the company to inform them, and was told the report would be passed to the production department. When asked if they would replace the item or conduct repairs, I was told since it didn't happen when I purchased it then they wouldn't assist me any further in the matter. I was instructed to take the item back to the place of purchase to seek a refund or replacement."}
{"rating": 1, "review": "I will not waste your time with all the specifics, let me just say my Maytag refrigerator is an absolute piece of crap. Do not waste your money. KMA Maytag I will never buy anything from you ever again."}
{"rating": 1, "review": "Died after 2 1/2 months of use.  Very disappointed"}
{"rating": 1, "review": "I really thought I was outsmarting the man by purchasing this filter at near 1/2 what GE wants for their OEM version.  After all, the headline is \"GE RPWF Smartwater Compatible\".  Wasn't compatible with my GE Pro model PYE22PSHSS.  Turns out there is an RFID chip under the \"BACK\" label on the GE OEM that prevents you from fooling the fridge into thinking it's just a regular filter.  After installing this filter, the fridge shut off the water and displayed a \"Filter Leak\" message.  If you still have the bypass plug, check it for the RFID tag, under the \"BACK\" sticker."}
{"rating": 1, "review": "The tension clamp is a piece of garbage! It is not shaped correctly, and does not fit into the hole, where the wire goes into. So, you are stuck with either putting the dryer cord in, without the safety tension clamp, or trying to rig something else. I am soo angry right now."}
{"rating": 1, "review": "This ice maker broke shortly after the return policy expired.  I did not mistreat, or even move the machine for that matter, before it broke.  It just began making less and less ice until it stopped all together.  When it did make ice, the ice was very wet and had a tendency to stick together.  I was not very happy with the the ice that it did make when it was working but I figured that the ice was ok for the price I paid for the machine.  Now that the machine has stopped working altogether I am very dissappointed.  If I were you, I would save my money and look elsewhere for a higher quality product."}
{"rating": 1, "review": "Was the wrong product for the refrigerator. Can't figure out how to return it."}
{"rating": 1, "review": "Very loud don't like"}
{"rating": 1, "review": "Lasted for a 2 loads of laundry then failed. Didnt even have full loads in"}
{"rating": 1, "review": "I bought two and they both leak. Going back to original."}
{"rating": 1, "review": "Very disappointed, less than a week after first installation I can already taste clorine in our water and ice. The original PUR filter went through 3 - 300 gallon cycles before I finally bought these filters and I never tasted clorine whatsoever. Live and learn, I was turned off by the cost of the PUR filters and tried to save some money. Next time I'll buy the PUR filters, but I guess I'm stuck with the clorine for two more filter replacements."}
{"rating": 1, "review": "too much hassle to bother to return.  It didn't fit our LG dryer.  I obviously read something wrong."}
{"rating": 1, "review": "Item was of poor quality (materials and workmenship) and also overpriced. Item was different than pictured in the description. Will not reorder."}
{"rating": 1, "review": "did not fix the problem, there is a design flaw in the manufacture of this part"}
{"rating": 1, "review": "Broke the 4th time I used it, real flimsy piece of crap. Ordered this to replace it Made in USA Steel wrench with longer handle for extra torque havn't gotten it yet but it has to be better than this turd.\n\nhttps://www.amazon.com/Housing-Wrench-11-WX5X140-Superb/dp/B013S2K6UK/ref=pd_cp_60_1?_encoding=UTF8&psc=1&refRID=SJ17KW1BY4BJ4EKW04EN\n\nGot the metal wrench today, what a joy, it worked like a charm without any struggle whatsoever."}
{"rating": 1, "review": "I bought a house with this hood installed (apparently installed around the time of purchase 3 years ago), last night it totally fell off the cabinet and into my food. Now it is an ABSOLUTE NIGHTMARE getting it back up, and it is so hard to find replacement metal filters. Also, the suction is OK, but not fantastic."}
{"rating": 1, "review": "I received 2 of these caps, 1 has failed already. Not impressed."}
{"rating": 1, "review": "The bags keep moving around in the garbage can so we have to keep pulling them up.  There isn't a way to hold them in place, and they start tearing after the 5th compactor use.  I wish I didn't buy these.  They aren't worth the cheap price."}
{"rating": 1, "review": "Have had no luck since Whirlpool decided to change the design of the filter. Have tried the Drop units as well as several off brands from big box outlets. Replaced the water valve and several filters. I eventually installed the OEM bypass and added a filter at the water inlet...problem solved.\nOriginal filters worked fine, new ones do not!!!"}
{"rating": 1, "review": "While this fits the LG fridge and does decrease chlorine and bad taste/odor, it does not meet the same standards as the spendy LG filter. This filter meets standard 42 which does remove chlorine and improve the taste and smell of your water. I tested it in my LG fridge, and the water tastes better than it did (as my LG filter had expired). But while LG also meets standard 52, this filter does not. That means that while this filter will improve the aesthetics of your water it will NOT address safety issues as it will not filter heavy metals (such as arsenic among many others), nitrates and nitrites, flouride or cysts from your water. If you trust your water company to provide you healthful water and want flouride in your water, this is a good option for you because it's much cheaper than the LG filter and does improve taste. I just plopped down 60 bucks for two genuine LG replacements as I just have more confidence in the safety of the product. I personally prefer the LG filter which meets both standards and improves the taste and aesthetics of my water and also addresses safety issues like the presence of heavy metals. Just know what you're getting- you're getting a filter that is a lot cheaper than LG but does not perform to the same standards. As one last interesting note, the package indicates this uses renewable coconut shells to act as the filter, which I don't know if that's good or bad.  Although the Aqua Fresh filter does work for improving taste, I'm knocking off four stars because I think the filter implies that it is identical to the LG when it is not because it does not meet standard 52 concerning safety issues."}
{"rating": 1, "review": "Scam!!!!!"}
{"rating": 1, "review": "Received product, opened and noticed scratches all over keypad, appeared to have been used, returned for refund."}
{"rating": 1, "review": "From the misleading way this product was advertised/listed, I thought it was an actual Kitchen-Aid brand replacement.  It was not.  It was a cheap, generic, knock-off that would fit in a Kitchen-Aid refrigerator.  It did OK for about 4 months.  Then the non-stick coating in the tray started pealing off and flakes of it were getting frozen in the ice cubes.  The company that sold me the ice-maker, North American HVAC, doesn't provide any sort of warranty on their products.  Obviously, they know they sell junk.  I won't be doing business with them again."}
{"rating": 1, "review": "SIMPLY.... this machine is a piece of JUNK!!!  As the reviews rated as 1 stated, it does wash your clothes!  It has taken me a while to say, I AM DONE!!!  But I am done, I have really tried to like this machine, but with Winter season, and washing a lot more sweaters, the machine does stretch them out because there it doesn't use an efficient amount of water.  One person stated, \"whoever designed this machine has probably never washed a load of clothes ever!\"  How true!  DO Not BUY!\n\nStar rating is required --- But there is no way to rate as a ZERO!!!!  I didn't even want to rate as a ONE!"}
{"rating": 1, "review": "Despite my attempt to be green AND save $$$ on a water filter, I am very unhappy with this filter.  It is smaller than the OEM filter for my LG which is no big deal but the filter continually leaks even when not in use.  I had to return this filter and will end up only buying OEM for my LG refrigerator."}
{"rating": 1, "review": "Customer service is NON Existent.\n\nI have a F&P two drawer dishwasher.  Generally speaking it is a good appliance, but if you need any parts, forget it.  The agitator tends to wear out.  It only costs about $100 to get a new one and it is dead easy to replace, BUT in my case F&P shipped the WRONG part under the right part number sticker, so the part didn't quite fit, or work.  I engaged a professional, who took the very same part number out of her truck and put it in .. and everything worked.  Cost me an extra $300... but here's the thing.  F&P said \"tough\" we don't accept returns  even if we made the mistake!... four times\n\nAnd after talking to some appliance service people, this is apparently pretty common that what is in the box doesn't match the number printed on the box.\n\nSo beware."}
{"rating": 1, "review": "It leaked the whole time I had it. What a pos."}
{"rating": 1, "review": "Wouldn't buy again. I don't like how my water taste with this filter. I was hoping it would get better with time but it hasn't."}
{"rating": 1, "review": "These were supposedly universal and ended up not fitting the range in an apartment I was moving out of. It was a Hotpoint model."}
{"rating": 1, "review": "The vinyl was too short, for the Maytag washer. It came at about 71\" and needs to be closer to 80-81\"."}
{"rating": 1, "review": "Two services issues in 3 months.\n\nWe purchased this LG refrigerator at an undisclosed major retailer - not Amazon.  The first issue arose within a week of purchase.  The unit would not close properly.  The \"major retailer\" was pleasant but generally pointed to the LG 800# for assistance. Once we called the LG customer service number - they pointed us to a service center for assistance.  Once the service center tech reviewed the unit, we found out it needed a part that was back-ordered. In all, it was 2-3 weeks before it was resolved.  At this point, LG should have just issued us a new refrigerator.  LG didn't - such is life right?  Four weeks or so later....\n\nIssue #2.  The refrigerator stopped working.  Yep - no cooling or freezing at all.  Several freezer items thawed.  We called LG - again.  They sent us back to an authorized service center.  LG was not accountable for the inconvenience (lost time, spoiled food, etc). This being our second issue in three months, I would have expected some type of amends other than \"We're sorry\".  I am sure they were...Not as much as us.\n\nThis experience should make anyone question the value of an LG refrigerator - especially one that costs more than $1,500.\n\nOther LG products may be good, but the service that sits behind them is (based on this experience) poor. For the price of this refrigerator, I would expect a better level of service.\n\nNote:  LG has a policy that they will not give you a new refrigerator unless:\n\n1) A support tech considers the unit permanently flawed OR\n\n2) The unit has been repaired three times.\n\nWe're on our second repair now (again - in three months) - so perhaps we'll get lucky and it will fail for the 3rd time. At this rate, I expect to have a new unit eventually. Too bad LG couldn't have made things right at the start."}
{"rating": 1, "review": "The quality was so poor -- neither of them were the correct size -- just looked like they have been randomly cut off a roll of filter material by a scissors and they are so light weight that they don't even absorb water.  My machine does not work at all with these filters.  Had to pay for them and try them and now money is wasted. Will never order these again.  Now have to buy another new one from somewhere else."}
{"rating": 1, "review": "We have this oven and over a few years we have found that you really can't use the top oven for anything but Broiling. For baking, it doesn't distribute the heat evenly and thing burn on the bottom. THis mean that the main oven is *on the floor* so it has reduced accessibility.\n\nAlso, we have had to replace the touch pad twice and likely will junk this range the next time it fails."}
{"rating": 1, "review": "Junk"}
{"rating": 1, "review": "Did not last a year without trouble....need a new photo cell ... it burnt out....looked everywhere to replace...no luck Very difficult to communicate with these people"}
{"rating": 1, "review": "Bought Oct '16 and the plastic casing broke by Apr '17. Seriously? Y'all can't figure out how to make a sturdy dryer knob? Bring back quality."}
{"rating": 1, "review": "Warring, this product broke off in my duct. I now have 6 feet of rod and the brush suck in my duct. I have no idea how I'm going to get it out."}
{"rating": 1, "review": "This is a defective product. Also, the company doesn't stand behind its product. The refrigerator malfunctioned about  1  1/2 years after purchase and stopped working. The compressor burned out after this time with only minimal use. It was very disappointing. The customer service attempted to resolve the problem but it was not easy to get them to  offer me a proper replacement after allowing a 15% discount on a replacement compressor which would have cost almost $200. It is unfortunate that the product did not perform well and the company was not supportive of their product. It is disappointing that Amazon sells this product for outdoor refrigerators."}
{"rating": 1, "review": "While I have no beef with the seller; but the product was faulty.  I used it for 2 weeks without any trouble.  After 2 days of letting it have a break, I  decided to use it again.  The timer was running, but the agitator was NOT!!  Therefore, I returned it.  I was also VERY unhappy with Amazon.com for forcing me to purchase another product from them, for the \"refund\" came in the form of a gift card!!!!!!  I wanted my money back.  I am VERY unhappy with Amazon.com.  I only purchased this, 2  books, and a reflective jacket for a friend.  When the Wonder Washer wasn't what she had wanted, I bought  it from her for myself, because I had made the mistake.  If I'd known that Amazon.com wouldn't return my money, I would have returned it without purchasing it from her!!"}
{"rating": 1, "review": "This is only 1 knob and not a set of 4. In my opinion it is a waste of money!"}
{"rating": 1, "review": "I purchased a Franklin Chef from the Home Depot 2.5 years ago.  The unit was marketed as being the size of a \"standard cabinet\" implying that it could be built in.  After I installed it (ripped out my cabinet) and read the manual, it says that the unit is designed to be used free standing only (that is a real problem).\n\nAfter learning this, I did some internet research.  Found that several others had made the same mistake I did and that their units quit working--left only with storage space in the cabinet areas.  Mine did manage to last 2.5 years, which is longer than I anticipated--I wired in some cooling fans to extend the life of the unit.\n\nFinally found a replacement.  Electrolux.  Now the Electrolux is 3x's the cost of the Franklin (or $1500), but it is designed for zero clearence and should be easily reparied.\n\nWhy the Home Depot continues to sell this poor quality stuff, I do not know.\n\nBut stay far, far away from Franklin Chef (and the other aliases they have used--can't think of them at the moment, but they do exist).\n\nDo the research!"}
{"rating": 1, "review": "Despite having the model number of my oven the product did not fit into the receptacles. I have learned a lesson to never order an appliance part on any internet site. I went to an appliance store and the correct piece was only $2 more than the price I paid on Amazon. I was told at the store that attempting to install the piece myself could have caused a fire. In conclusion, pay the extra few dollars to get the right item from an appliance store so you don't have the problem I had."}
{"rating": 1, "review": "The description says 26 x 19 it is only 23 x 16. This will not work in my oven I need a refund or a replacement!"}
{"rating": 1, "review": "I felt like I should post a review for this so I can warn folks: this is NOT EASY TO INSTALL. My husband sensibly decided to abort the mission when our dryer didn't match the dryer in the YouTube video he was using as a guide. You have to basically take your dryer completely apart to remove he drum, and our control panel didn't have tabs for removal, and all the wiring was in a box on top of the drum. Time to let the pro come in and install."}
{"rating": 1, "review": "I installed it, 2 weeks later, it stopped working. It won't turn off the water from flowing out through the water dispenser. I opened it up. The bores are not clean the plastic pieces may block the valve and the springs for pushing the valve close are of those found in the ball point pens."}
{"rating": 1, "review": "Color was off , it did not match DeLonghi knobs"}
{"rating": 1, "review": "We bought this cook top several years a go.  It does not provides the heat needed to cook fast as it is expected from a high end gas cook top. We recently spilled some poaching water in which a fish was cooking.  The water created a short circuit in the switches and the electric ignition keeps sparking.  The worst part is that it is impossible to clean under the burners and the water smells so bad that we may need to get a technician to open and clean up the bottom of the cook top. Will never buy GE again."}
{"rating": 1, "review": "wrong piece"}
{"rating": 1, "review": "The fridge came with 3 different dents in it and the box it was shipped in looked like absolute crap. It looked as if they had drooped it from a truck or something."}
{"rating": 1, "review": "If I could give 1/2 a star I would. The Zephyr hood I purchased (slightly different than this one) was part of a kitchen remodel six years ago. The switch for the light and the slowest fan speed went bad, so I called the company to buy replacement parts.  Guess what   they don't make replacement parts anymore for the model that I have. I spent $2000 for an item that I certainly thought would last longer than six years.  I explained the situation to which the company offered me no help or no option to purchase another item at a discount.  Now I'm left with a piece of useless crap hanging in my kitchen.  I can only wish you luck with the Zephyr company if you decide to purchase their products."}
{"rating": 1, "review": "had callback on 2 out 8"}
{"rating": 1, "review": "Received a 3 pack. One of the filters rattles internally. Not installing it in my water supply. Where are these made? Amazon apply credit for filter. Anyone else have this problem?"}
{"rating": 1, "review": "Wish I could give it 0 stars. So cheaply made and thin. Received it bent in multiple places."}
{"rating": 1, "review": "I just wanted to echo what others wrote. Water goes through the guard slowly, and you have to push food waste down past it. This is really idiotic design. I wish one could just get the same splash guard that came with the disposal, as it worked just fine. I may try to modify this one with scissors so that it works better."}
{"rating": 1, "review": "This came with my new dishwasher, it is pathetically small in every way. Have to remove the top to put any silverware in it and then it doesn't hold very much. Don't waste your money, The 5 star reviews are from people that are paid to write reviews......"}
{"rating": 1, "review": "Be careful with this seller. They are advertising high quality Southbend light bulbs but I got cheap Philips light bulbs. Apparently this has happened to other buyers. I will now have to spend a considerable amount of precious time trying to resolve this issue."}
{"rating": 1, "review": "Did not fit. And of course no return"}
{"rating": 1, "review": "The fridge door frame was damaged when arrived. Also damaged is the side wall. Can't say much about the functionality since it just arrived today."}
{"rating": 1, "review": "Do NOT buy this if you want frosted glasses!  It does not cool the glasses enough to make them remotely frosty and there are no controls to set the temperature.  I built an entire bar around this piece of junk and have spent five years looking for an alternative that fits into the space that I had custom designed."}
{"rating": 1, "review": "It's a bit loud & when I should open it, everything would be wet. Very disappointed."}
{"rating": 1, "review": "I wish I checked the reviews before hand.  Didn't think I would get shorted with two filters advertised in the picture.  Very misleading and bad business."}
{"rating": 1, "review": "Run too load suck smoke not much about 40%"}
{"rating": 1, "review": "I found this really difficult to use; it's just too large to use and do any good. It fits in the filter area, but I can't get into the areas where the build up is, even with the smaller end brush. Just will not do what I need it to do, that is, really clean out the lint left behind."}
{"rating": 1, "review": "I'm very disapointed that the item was out of stock even though the Amazon status states that it is in stock. I'll go elsewhere to purchase."}
{"rating": 1, "review": "These were for a GE Profile refrigerator replacing the GE MWF. The first one installed produced a slight dribble of water from the dispenser while sounding like the filter was going to burst. The second one works significantly better but is still much slower than any other filter I have used (I've tried at least half a dozen different manufacturers). It is no where near the 0.5gal/min advertised. I contacted the company and they refunded me the cost for one of the filters. I decided to keep the second filter despite the slow flow rate. I wouldn't buy these again."}
{"rating": 1, "review": "I have a 2015 Electrolux/Frigedaire bottom drawer freezer which allows ice to fall out the back when the ice drawer is pulled forward, even when the bucket is half full. Apparently, this is a design problem that has been present for years. Our dealer told us just to pull the ice out manually before opening the drawer to prevent this ! If you don't, eventually the bottom freezer drawer won't close all the way until you pull all the cubes out that fell behind the drawer. Electrolux customer service told me that this part would  correct the problem. After receiving it without instructions, I got some ideas from the internet that the part could be clipped on in only one direction, which is not true. There are 2 ways to put it on, on either side of the horizontal part of the bail arm; one way prevents  the drawer from closing, the other way prevents  the drawer from closing. Bad design. They need another design !"}
{"rating": 1, "review": "I ordered the stack kit W10298318RP; I received a belt W10131172.\n\nThe Maytag part number W10131172 was in a large font\nacross the full width of the bag the belt was in.\n\nPandora's Packing Slip said they shipped me what I ordered:\n1 W10298318RP Maytag Whirlpool Dryer Washer Stack Kit W1029831RP New & OEM\n\nI received the wrong product 1 day past the 6 day delivery estimate.\nI pay the return postage."}
{"rating": 1, "review": "This is my second one ordered the first one I ordered I asked for an exchange because the gauges were not working. When I receive the replacement it was used. Parts were missing, the undercarriage was bent, there was a puncture inside the Kegerator and one of the shelves were bent. Not to mention when I open the Kegerator there was hair inside of it.\n\nThe directions to this are not that great however, you must follow them or it will not work. Beer will come out with nothing but foam.\n\nFor the price it is good if you receive a good new never opened unit. I recommend you get the warranty. I give this a one star because this order was supposed to be the replacement however I received a used item. Pictures reflect missing items and how used this product was when I received it."}
{"rating": 1, "review": "The filter received is not the same color as the filter in the picture. The filter also developed mold very quickly, When turned off for three days the filter developed horrible black mold."}
{"rating": 1, "review": "Hi, they did not fit. This has me a bit disappointed. Is there any way you can help. Awaiting a timely response"}
{"rating": 1, "review": "We have had this for less than 3 months. The motor seal is defective and water is seeping into the motor housing, which means it cannot be repaired."}
{"rating": 1, "review": "Not so sure yet. After replacing the filter with this one, my water dispenser and ice maker stopped working. I will take and test the power to the water  valves. I keep you posted,  REL."}
{"rating": 2, "review": "Part broke while installing. Cleaned old switch part & re installed. Works OK."}
{"rating": 2, "review": "This product splashes water on inside of freezer freezeing ice bin in"}
{"rating": 2, "review": "I have owned a 12\" Broan 1050 trash compactor for five years at my previous home and loved it, which is why I decided to stick with the Brand. Unfortunately, I am dissppointed in this new version after being spoiled by earlier models.\n\nThe quality of the materials used and the compacting mechanism in the smaller 12\" compactor model is far superior than the updated 15\" model.  The 15\" stainless door looks great in the cabinets and appears to have the capacity for a weeks plus of garbage. However, once you open the door you will realize only the bottom half is used to place the garbage.  The compacting mechanism in this model does not compact as well as the older 1050 model.  We used to only take out garbage once a week on garbage night and now find ourselves taking out garbage twice a week (we have not added more garbage).\n\nSomehow Broan designed this model to be wider which takes up more real estate in my kitchen while reducing the quality of the crush."}
{"rating": 2, "review": "I ordered the biggest ones I could find on Amazon, but they still don't fit the two biggest burners on my LG gas range. I am disappointed. They are ok for the back burners that are smaller, but nothing ever boils over on them."}
{"rating": 2, "review": "came defective, but easily returned"}
{"rating": 2, "review": "These filters didn't fit my refrigerator, even though the links directed me to this filter. I tried another website and had similar results. For my particular refrigerator, an LG LFX25974ST, only the LG filter works. I don't blame anyone here, but double check before you order."}
{"rating": 2, "review": "Initially ordered this product in 2016, and it worked fine. Ordered again it to replace the old filter for regular maintenance. Water was cloudy even after several gallons dispensed. Exchanged for replacement, thinking it might have been a fluke. Water was still cloudy even after several gallons dispensed. Requested another exchange to give the seller the benefit of the doubt, but was charged a restocking fee of $11.96.\n\nSo instead, I ordered the Frigidaire ULTRAWF Refrigerator Water Filter Sold by: Amazon.com LLC, which supposedly works for most french-door Frigidaire models. It's a little more expensive, but it works great: water runs clearly and seems to have higher throughput."}
{"rating": 2, "review": "Not as good as the original equipment filters that I have purchased at one of the box stores in the past.\nDoesn't stand up correctly and does not wick the water up after a few hours, so it dries out and the humidifier runs for nothing."}
{"rating": 2, "review": "I bought it from a store same one though and it is too cold it freezes the drinks if they sit in there long enough"}
{"rating": 2, "review": "After replacing two of these, I discovered why mine was breaking.  Bear with me, it works as good as new now.  The opposite end of the screw is held in it's plastic bearing by a plastic nut held in place only by friction (like a nyloc nut).  If, as the screw turns, the friction stops holding, then the auger screws through the nut changing the horizontal alignment.  Then the end of the screw now protrudes from the nut and rubs tightly against the outside of the bucket housing, and at the other end the cup is now not seated in its circular housing (part of the bucket) but has backed out so it easily gets kicked out of the housing by ice cubes.  Incredibly dumb design.  I took the whole thing apart and drilled a pin hole through the nylon lock nut/bearing nut and through the aluminum rod that goes through it.  I pinned it with a small nail so now when the nut is at the correct position to align the entire assembly, the nut cannot rotate and \"screw\" everything up.  Now the auger doesn't rub on the outside end and on the other end the cup is perfectly seated.  Works perfectly and is not going to get dislodged by ice or gradually drift out of alignment.  A tiny drill and a small nail.  Good luck.  A whole new mechanism with the same friction lock nut is going to eventually slip the same way."}
{"rating": 2, "review": "Does not keep out the cold as well as it claims.  Is not as easy to instal as it claims and a  more flimsy than I expected.  I had the choice of 2 products.  This one was a little less expencive.  wondering now if the other vent closure would have been better?"}
{"rating": 2, "review": "It kinda doesnt really match my other stainless steel appliances in the kitchen and the corners were a mess even after trying to use a blower."}
{"rating": 2, "review": "Worked fine for 2 months. After the ice quality was pretty bad, but it will fix itself every other day, but this was an on going cycle. The power went off for this product in about 6 or 7 months and the Hamilton beach customer service has been terrible. They ask me the same questions and make me do the same thing. Asked for a supervisor, gave out my contact info, and a month later still no contact. Called back and was told they don't know anything about this ice maker. Basically SOL and I now have a massive paper holder. Warranty claims free from defects up to a year. I heard some strange sounds coming from the ice maker and I walk by to check on it and the power completely went out. No other outlets can turn it on. Buy another brand and hope their customer service can help."}
{"rating": 2, "review": "I suppose they work fine, but I have not been able to install them because the directions are not clear.  I googled for help, but I cannot find illustrated directions anywhere.  I'll keep trying."}
{"rating": 2, "review": "I bought two of them. One leaked all over the refrigerator.  The other one was fine."}
{"rating": 2, "review": "I purchased this item for my home humidifier.  Seemed like a great deal.  The part that the manufacture tells you to buy, the OEM part, is 3 times the cost.  Now expecting to get some life from this as the last one, the OEM, lasted 3 months, was not too much to ask.  Or at least that is what I thought.  This one lasted 15 days.  Now it could have been due to a lot of factors as this is the coldest it has been in 20 years, so it may be running a bit harder than usual.  Now I am not one to complain about much, so I just let this one go.  My next purchase on this was another off brand name from a home store and that one has lasted the past 7 weeks so far."}
{"rating": 2, "review": "Doesn't really replace 4392857 - it's a different nozzle and doesn't fit in my fridge."}
{"rating": 2, "review": "Really appreciate the size for my teeny kitchen, however it never bakes anything right! None of my breads or cakes have raised like they should, frozen pizzas stay raw in the middle and quickly burn on the bottom. I've gone through years of experimentation and have concluded its just an awful oven. Good thing I mostly use the stove! Oh, and labels for the nobs have worn completely off. I had to relabel them with my label maker."}
{"rating": 2, "review": "Have only owned for a week, so not sure if it will last.  There was no plug as in the picture and in the description. Even though it said it was compatible with my oven, it had to be removed from the cage it came in and placed in the old cage in order to connect to my oven properly."}
{"rating": 2, "review": "I only received 1 bearing and rubber seal although the description states it contains 3 bearings. The one bearing I received did fit and luckily the second one that i was going to replace was still good."}
{"rating": 2, "review": "Generic part.  Fit okay.  Failed after 1 month.  Now I have to go buy the OEM part and hope it works longer\nthan 1 month."}
{"rating": 2, "review": "It works but have to replace three times over a ten year period."}
{"rating": 2, "review": "Was good while it lasted, however just a few weeks ago the machine stopped working.  Several months ago the indicator light letting you know to fill it with water stopped working so we'd go to the machine and there would be no ice because there was no water in it, but no one refilled it because the indicator light wasn't working and the \"full\" light stayed on even when there was no ice.  Now it doesn't do anything. No ice. No noise. I guess the cost was more of a \"rental cost for a year\" than a purchase."}
{"rating": 2, "review": "This product has been redesigned, according to the manufacturer.  It is now slightly smaller and has a completely different connection than what it used to be.  The connection no longer looks like the product pictured.  The connection has 3 \"teeth\" instead of two, they are differently shaped, and it simply does not fit.  I have been unable to install it at all.\n\nUPDATE:  After reading Patrick Rigney's helpful review of the same product I tried one last time to install the filter.  And in fact with considerable force it did finally work.  So I have upgraded my review from 1 to 2 stars.  I don't know why the manufacturer would redesign a product to make it so much more difficult for the end user."}
{"rating": 2, "review": "I think there was some misunderstanding on the part of the seller.  I specifically asked if this would be comparable to my refrigerator and its not. The seller was quick responding to me about my inquiry, but it doesn't fit.  My refriger is GE Model #pfs22siscss for those who may need to know.  Thanks."}
{"rating": 2, "review": "You will need 3 1/4\" x 10\" rectangle to a 6\" round duct transition for installation. It's nice they don't tell you that on the box, but you find out when you're in the middle of the install and it tell you on step 14 that you need that piece. Also, the unit I installed had absolutely zero hardware, so yet another trip to the hardware store for the screws to hold the plenum onto the bottom.of the cook top and the nuts holding the fan to the plenum"}
{"rating": 2, "review": "Unfortunately bought a two pack ... first one worked great, but once that was done, tried to install second one, but water leaking all over the place, the seal between the filter and the refrigerator is just not secure.  Product quality and consistency is just not there.  Since it's been more that 6 months, I can probably not return the defective one ..."}
{"rating": 2, "review": "It's an okay product, filter has to be replaced to frequently...very expensive...feels like I'm always buying this product. No bueno."}
{"rating": 2, "review": "Works as described but stoped working twice."}
{"rating": 2, "review": "Super nice freezer but it was a banged up mess when I got it so I had to return it."}
{"rating": 2, "review": "The door was fine. It was getting it installed that gave me trouble.\nGordon Gerick"}
{"rating": 2, "review": "These filters restrict air flow in my Kenmore humidifier.\n\nThe result is that the motors have to work harder and they overheat - the odor of melting insulation was my first clue. I also removed the cover and placed my hand on each motor and they were definitely very hot (ruling out that I had one faulty motor).  For a quick fix I 'bowed' one filter in each side, breaking the airflow seal to allow more airflow and reduce stress on the motors.  This helped but, of course, breaking the airflow seal kind of defeats the purpose of drawing air THROUGH wet filters for humidification.  I do like the construction of the product - maybe they work out better in other manufacturers units.  For me it's back to the OEM filters."}
{"rating": 2, "review": "The biggest problem with this product is the length of the string/cord thing that attaches the cap to the rest of the device or faucet.  They don't look that bad in the photo, but when it is put on they really tend to get in your way if this is on a sink that is used often.  We put it on a sink at our company's break room and it is very common to have employees complain about the string things in the way.  However, the caps don't cover the water discharge items in a tight manner at all and it is very easy for them to get knocked off, so you kind of want the strings to remain in place to keep the caps around.  Maybe somepeople wouldn't care if the caps were lost and if that was the case that would solve all your problems.  We've resorted to tying the stings up and around the little u-shaped discharge arms/tubes.  Overall, the biggest improvement would be making the caps fit over the discharge holes in a tight manner so you didn't need the strings and you could cut them off.  We bought this to replace a previos one that had worn out over 10 years and its caps were more rubbery and really stuck onto the discharge areas well all by themselves, these are very loose."}
{"rating": 2, "review": "cheap packaging. quality not good as expected."}
{"rating": 2, "review": "Snaps right in with just a few minutes of work. The original control panel had to be replaced as the buttons ripped open on by one. I did buy another year or so with tape over them to keep water out and keep the contacts in place. Just days after installing the replacement the covering is already peeling after just one use. It seems planned obsolescence strikes again. For over $100 I wouldn't need to replace this too many times to make buying a new dishwasher economically wise. The shipper had this packed fine and the item was new when I bought it. I will probably consider a different brand in the future."}
{"rating": 2, "review": "I bought these because of the 2-for-1 pricing, but the water tasted horrible.  I put the old filter back in until I could get the Brita filter, which worked great."}
{"rating": 2, "review": "The larger two were too large."}
{"rating": 2, "review": "this product works okay but the price if crazy for 3 pieces of metal. this should be more around the $10 range. when I opened the box I thought there had to be more."}
{"rating": 2, "review": "The bottom of this is ridiculously tight.  You have to push on everything to get it into the disposal.  I finally got frustrated and just cut the bottom, so that the hole was larger."}
{"rating": 2, "review": "Although the product appears to be manufactured by Bosch based on the Amazon category, these are actually made by 3M - not Bosch. Bosch is one of the many appliance manufacturers who use this size/style of filter."}
{"rating": 2, "review": "Not a perfect fix for the small chips on my smooth top cooker."}
{"rating": 2, "review": "I have an AV series extractor, and this filter does not fit into the matching mesh grill even though there is a depression in that item to allow for it. With both that mesh and this installed, this filter bumps into the fan and prevents it from running. With this problem the best bet is probably to just break the wire mesh and charcoal pads out of the metal frame on this filter, or just attach the whole thing to the outside with a needle and thread."}
{"rating": 2, "review": "Disappointed about 2 things. The hood came with a dent in the side and it came with no lights in it. So now we have to go hunt down the right size bulbs. I do think it looks fabulous!!!!"}
{"rating": 2, "review": "Great for broiling all types of meats but, hard to clean because it's not non-stick. It also starts to warp a bit if it gets too hot @ 500 degrees.."}
{"rating": 2, "review": "Thin metal and the fan is weak.  Pretty cheap material.  Bought for a rental so who cares"}
{"rating": 2, "review": "They turned light blue and I do not know why. I could use some feedback. Thank you"}
{"rating": 2, "review": "Had to replace our original top dishrack because the plastic finish on the wire frame started to peel away and the wire began to rust very badly.  The original dishrack had movable tines that would allow for larger glassware to fit nicely.  This product has all fixed tines which is very disappointing."}
{"rating": 2, "review": "The stainless steel version easily scratches. Marks all over the place from normal use in a matter of less than year.  Also, the 2 removable tip grills have pointed tips which also contribute to scratching up the top. GE could have done a much better job offering customers a more resilient customer friendly product that would look good in the long run."}
{"rating": 2, "review": "I read the reviews on how cold this gets -not cold enough.  One reviewer said it is a chiller for wine that doesn't need to be very cold.  Well the packaging shows it filled with cans of Coke!  The owners manual doesnt give any temperature range beyond \"Max and Min.\".  I bet most people will see this as a beer and soda fridge and it may not do the job well."}
{"rating": 2, "review": "Had them less than 60 days and they are already tarnished.  They are acceptable - but next time I'll look for black ones."}
{"rating": 2, "review": "Did not fit my stove."}
{"rating": 2, "review": "These nobs are very cheap quality made and they are very loose even it fit your stove. You have to constantly refit them to use it. not very universal"}
{"rating": 2, "review": "Noticed breakage by 3 use."}
{"rating": 2, "review": "IS OK"}
{"rating": 2, "review": "bought 2, only meant to buy 1.\nopened 1st one to find black stuff on it and holes.\nopened 2nd one and it feels stronger, more rigid than the first...has sharpie lines around it for some reason."}
{"rating": 2, "review": "The product would be great if they would package it differently.  The drip pans came stuck together, and the larger ones took a fair amount of force to get them apart.  Where they were stuck together the porcelain / enamel finish is damaged, and in one spot is showing the metal underneath.  I returned the first set and the second set just arrived, stuck together the same way, and with damage just like the first set.  If it weren't for this they would be perfect."}
{"rating": 2, "review": "The threaded end of one of the axles was machined wrong making it useless. I had to use the old one in its place and the new 1/2\" nut fit as it should.  Checking the threads first before installing the assembly would have saved me time and trouble. I was fortunate that the roller I replaced was the culprit and not the axle itself."}
{"rating": 2, "review": "It looks great. Unfortunately, it arrived dented. Then the replacement arrived dented. So disappointed."}
{"rating": 2, "review": "First order fit.  Second didn't.  The fittings that lock it into place are a little different.  You'll just have to trust me, the second order of the same thing (it was listed the same on Amazon) just won't fit. The one that fit was labeled RFC0200A and the one that didn't was labeled RFC(TM)0200A (the TM is superscript).  The picture doesn't show the label, but it does show the different fittings.  It's a frustrating experience."}
{"rating": 2, "review": "didn't fit all burners. I think it is the connectors. These are a bit shorter than mine."}
{"rating": 2, "review": "Had to return it. It appeared to be the correct part but didn't really line up when we got it. Returned"}
{"rating": 2, "review": "Seems a bit smaller than it should be for an office frig. It does keep things cold."}
{"rating": 2, "review": "Not the most exciting product, but it was at a good price and beats the hell out of my old ones.  I have a stove/oven from the 60's that I really like and just freshened up with a new controller for one of the burners and a couple of new heating elements for the ovens.  I've done stove burner elements before and over the last 15 years or so done a couple of replacements of the drip pans.  The last set had a couple with huge hole rusted/rotted/burned through them, so this is probably more than just cosmetic.  It is probably helping heat my pans faster due to reflecting the heat upwards."}
{"rating": 2, "review": "These stove knobs do not work for the Amana self-cleaning electric range models ARR624 amd ARR626, unless you have a handy husband who can jerry-rig the extenders into a stack long enough to reach the metal inside the range, and plastic-weld the stack of extenders to the universal stove knob."}
{"rating": 2, "review": "Does not fit washer. Returned with no issues."}
{"rating": 2, "review": "Looked and felt like a child's resend washer"}
{"rating": 2, "review": "I ran over 4 gallons of water through this filter before using it and it still tastes horrible. You get what you pay for..."}
{"rating": 2, "review": "I finally bought a new oven after 29 yrs. I planned to put the liner on the bottom of the oven for spills but you aren't supposed To put it there. You can put it on the rack.  I wasn't thrilled."}
{"rating": 2, "review": "Be cautious.  They say this is the replacement motor. But the wiring prints say it's not."}
{"rating": 2, "review": "it leaks when it is in the off position.."}
{"rating": 2, "review": "Not the same bags as in the picture, I received the \"drawstring bags\" rather than the \"true tie\" bags, which were what I was specifically looking for.  Also, the bags seem a little past their \"use by\" date and leave an oily film on your fingers after handling.  So not great, and I would not purchase from this vendor again."}
{"rating": 2, "review": "Poor Quality... Filter breaks down quickly.."}
{"rating": 2, "review": "Not good for stove"}
{"rating": 2, "review": "The ID (inside diameter) at the connectors is about 3/16 of an inch.  That is less than a quarter inch opening.  It will take forever to fill my Kenmore washing machine.  Yes - the coupling will screw on to the washing machine but that tiny hole that the water has to pass through on each end will slow down the flow of water (amount per minute) in the washer significantly.  The pressure will remain the same but the amount of water per minute to fill the machine will be reduced radically.  It will take about twice as long as normal to fill my Kenmore washer.  There are two fill cycles and the rinse cycle so the whole process of laundry will take about twice as long.\n  This is like filling a swimming pool with a drinking straw - it will take forever.  I purchased&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Certified-Appliance-WM60SS2PK-Washing-Machine-Hose-2-Pack-60-34-Stainless-Steel/dp/B01BRU4VCO/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Certified Appliance WM60SS2PK Washing Machine Hose (2 Pack), 60\", Stainless Steel</a>&nbsp;and found that they have a 5/16 opening which will fill my machine a little faster than the Kenmore hoses it came with.\nOddly enough they are all made in China (naturally!) but the hose from Certified are considerably better made and heftier."}
{"rating": 2, "review": "Ice cubes melt to fast.  Otherwise, okay"}
{"rating": 2, "review": "I like water cold from the refer, I don't like having to buy these filters although they all have them"}
{"rating": 2, "review": "The knobs fit and are an exact match cosmetically. However, the price of these things for what they are feels like a dinner date with Chris Brown where Bill Cosby is the chaperone. I'm sore in a very uncomfortable place. And it's not in the back of a Volkswagen."}
{"rating": 2, "review": "Machine stopped working wouldn't pump any water through, liked while it worked"}
{"rating": 2, "review": "Pricy!"}
{"rating": 2, "review": "Was a generic part sold under oem guise. No matter what is claimed by seller it was not OEM!"}
{"rating": 2, "review": "These say Universal, but they will not fit the tines in my dishwasher rack even after warming them up. These are very tiny."}
{"rating": 2, "review": "<div id=\"video-block-R19XX07WEWP6M7\" class=\"a-section a-spacing-small a-spacing-top-mini video-block\"></div><input type=\"hidden\" name= value=\"https://images-na.ssl-images-amazon.com/images/I/A1u3P-vCNoS.mp4\" class=\"video-url\"><input type=\"hidden\" name= value=\"https://images-na.ssl-images-amazon.com/images/I/81lfo6i5bqS.png\" class=\"video-slate-img-url\">&nbsp;I was really excited to get this fridge, and it works decently as far as refrigerating goes... But way the door is attached means it falls off almost everytime I open it! And I can't store anything on the inside of the door or else it crashes to the floor really hard. At least once a day my roommates will hear a bellow of frustration from me because I've just been going to grab a water and the door has come off again. SO annoying."}
{"rating": 2, "review": "I bought this range a little over a year ago.  I cannot use the self clean because the door won't lock.  I tried to use the steam clean feature and the bottom buckled up.  Also, we're always needing to adjust the temp.  Too bad as I thought it looked nice!"}
{"rating": 2, "review": "Good Filtrete filters, but smashed up upon delivery. They work okay, but I'll buy locally. Their smashed enough to not fit right."}
{"rating": 2, "review": "Purchased first Sentinel WSG-1 filters over a year ago and thought they were great. Ordered replacement filters last month and tried them. Very low flow.... less than the filter I was replacing. Upon closer inspection, the filters are a different design. Perhaps the new filter does a better job of filtering. I'm not sure. In any case, the flow is so slow, it is frustrating. I will not buy again."}
{"rating": 2, "review": "These are generally good but the last one I bought appears to be slightly defective and after installing and reinstalling it makes a nosie when I get water and flow is abnormally slow.  Tempted to try off brands for far less money."}
{"rating": 2, "review": "they are tiny.  thought they were 62 gram size.  boy was I surprised that they were a miserly 8 grams!!!"}
{"rating": 2, "review": "Expensive considering it's a piece of plastic but there aren't other options"}
{"rating": 2, "review": "Weighs a ton.  I couldn't hold it upon to my hair in one hand and use it."}
{"rating": 2, "review": "This is based on municipal water supply in Houston, TX.\nI suspect that we have high levels of silt in the water that cause the short life.\n\nWhen new it will dispense 1L of water in 12 seconds.\nAfter a month it takes 30 seconds.\nAt 2 months it takes 60 seconds.\n\nWhich means that to not be annoying these need to be changed monthly (more or less).\nAt $35/each, that represents $420 per year.  Absurd.\n\nI did the math and for us it is actually cheaper to buy bottled water and just use this fridge filter for ice."}
{"rating": 2, "review": "this is really a 3.5 but does not deserve a 3 hence the 4 stars.  The range is very nice, but upon arrival the left burner would not light with the piezo spark so I have to keep a barbeque type lighter next to the range when I use both burners.  I also wish that it would produce a little more flame.  the ring that separates the flame from the bottom of the pan is a little high in my opinion.\nDoes it work?  absolutely.  Takes longer to boil a pot of water in the current config but I may try to find other rings that will lower it a bit.\n\nUpdate!!!\n\nHad been reasonably happy as you can see from the above review. However, I boiled some water this morning and turned everything off including the gas source as I always do.  Approximately 5 minutes later I heard a crash and rushed to the kitchen to find that the glass top of the unit had completely shattered with some very sharp pieces on the floor.  The glass is mostly intact however it is completely shattered similar to what a car windshield might do but without the little square safety features.  These are jagged pieces!  I tried to contact the manufacturer but no answer on their 909 area code phone"}
{"rating": 2, "review": "Don't buy it if you are going to use it everyday... Not durable..."}
{"rating": 2, "review": "I bought these for canning season. The high heat for canning often turned my glass top on my gas stove brown that required a lot of scrubbing to get it clean again. These worked well keeping the glass from turning brown (there was a little browning), but they tended to slide around and cutting them to fit around the burners was not easy.\n\nWhen they arrived they were crimped, folded and a bit mutilated because the packaging was just a plastic envelope. I used an iron to try and straighten them out, but that only helped a little. If they had been packaged better - perhaps in a box - and not all bent they may have worked out better on my stove."}
{"rating": 2, "review": "Washed three medium sized towels, they smelled clean after a few minutes. Frame seems flimsy and clothes and towels were left drenched in the barrel. They should have created a way for you to spin the water out of the clothes but of course thats another product, another purchase. Its was hard to spin in the tub I moved it to the kitchen sink that seemed easier. I noticed very little leaking overall I don't think its a fit for me I will be returning this for a motorized version."}
{"rating": 2, "review": "had to order another one. it only cooled to 49 degrees, we'll see what the 2nd one does."}
{"rating": 2, "review": "Box arrived in good shape however the plastic filter piece was cracked beyond repair so I can only assume it was shipped like that. I managed to use the one of the old pump and make it work."}
{"rating": 2, "review": "I would splurge and buy The actual GE product next time. Makes my refrigerator make funny noises. Not the best."}
{"rating": 2, "review": "Didn't even last a month."}
{"rating": 2, "review": "I bought this in January, and the replace filter light came on about 4 months later."}
{"rating": 2, "review": "This things don't last long. I went through two in less than a year. Buy the LED style light. It's brighter and lasts a long time."}
{"rating": 2, "review": "just installed in new stove top.  front heating element not in line with cooking circle."}
{"rating": 2, "review": "After buying some 4\" vinyl tubing from west marine at two bucks a foot, I kept my eyes open over the next week to see if anywhere else stocked it for cheaper. Luckily I came across this product at Menards for a fraction of the price.\nAs others have mentioned it stinks. The stuff at west marine did not but it wasn't worth the extra $30 for a 20 foot for chunk! I returned it and went with this product."}
{"rating": 2, "review": "Therma fuse worked great, however the thermostat was the wrong one. ??? Replacing the therma fuse worked, but 2 weeks later it went out again."}
{"rating": 2, "review": "This assembly did not match my washer. Ended up taking only the motor and kept the old attachment bar and hose shell. The screw holes didn't quite line up so had to shimmy one screw to make it fit."}
{"rating": 2, "review": "Did not cover completely."}
{"rating": 2, "review": "Not a good taste. That's what I get for trying to be cheap. Only way this works is to drink while water is still fridge cold"}
{"rating": 2, "review": "Here is what you will get after couple years.... Leaking from the bottom... need to replace"}
{"rating": 2, "review": "I had two old bathroom fans that work, but the grills were starting to look pretty grimy.  These work great, but did not include a screw top to hold it in place.  The old ones were a bit rusty/corroded, so I just have regular screws holding it.  It would have been nice to have a matching screw top."}
{"rating": 2, "review": "It worked well as long as it worked. My well water has sediment so a filter doesn't last much longer than a month. These wouldn't wick water above the evaporation line after only about a week."}
{"rating": 2, "review": "Item is 8 foot not 12 foot."}
{"rating": 2, "review": "This range hood would have looked great had it come undamaged. Thank goodness the glass survived. It also seem like I got returned range hood and not a new one like I paid. Some of the screw holes seem used before. Kind of disappointed with it cuz of all the dents and scratches."}
{"rating": 2, "review": "We have not been happy with this product.  Purchased in 2011,  we are already on the second repair.  I can't recall what we needed for our first repair but this time the rinse aid cover broke. I am glad I purchased an extended warranty which we don't usually do.  Additionally,  it has gotten very poor at washing.  It seems,  I had not been on top of the maintenance, so it is no longer cleaning dishes.  But this dishwasher has alot more maintenance than any other dishwasher I have ever owned.  In this case we were told to clean out the holes in the sprayers every 6 months.  Plus run a conditioner through every now and then.  I'll try to update if it turns out that fixes our problems.\n\nThe third rack for silver ware seemed like a great idea but in practice it is very annoying to have to lay the flatware out individually, and it doesn't come clean unless you do.  (Laying it out in order does save time later as  you won't have to sort to put the flatware away,  but I haven't been able to convince my husband or son to do this so I still have to sort. )\n\nIt has never been as quiet, nor has it cleaned as well, as my previous dishwasher which was an Asko.  I expected to have some loss in cleaning due to increased water conservation (though the Asko was pretty good in that regard) but I am still not impressed.  It is still quieter than most dishwashers,  but at the price this is I expected better quality."}
{"rating": 2, "review": "I brought 3 and 1 of them constantly shows a relative humidity of 20%.  I guess you get what you pay for."}
{"rating": 2, "review": "did not realize supco 410 does not work on compressors less than 1/4 hp. my mistake."}
{"rating": 3, "review": "The controls are a bit confusing. It automatically vents - which is noisy. I would have preferred to have control over the fan. And I have now decided one full size over would have been plenty with a smaller oven. Also, I had to have the heating element replaced when under warrantee cause it took over 20 minutes to heat up - crazy. Still not great but better than the 20 minutes."}
{"rating": 3, "review": "Water taste fine."}
{"rating": 3, "review": "Fit my Kenmore fine (the handle had broken off the old one after 15 years), but if you are on good terms with any appliance installation or repair places, might be able to get one free--most discarded dryers have lint screens intact."}
{"rating": 3, "review": "Easy to install and much cheaper than from Sears or Whirlpool.  This is a plastic item so make sure you follow the instruction or YOU WILL BREAK IT.  One can only wonder if it is designed to fail."}
{"rating": 3, "review": "It fit perfectly and worked like a charm, but after using it for a several months, the dial became harder to turn. It possibly needs lubrication."}
{"rating": 3, "review": "Has everything you will need, but...\n  1. For my particular install, I needed 50ft more of the furnace wire, which ran me around 9 bucks at the local big box store.\n  2. Again for my install, I believe it was a bit overpriced overall, but again I did not price out each article that is included in the kit separately to ensure this.\n  3.  My suggestion would be to, install your humidifier and the controller, then measure out what you will need to make the  final wire, water and ductwork connections.  That way you can buy exactly what you need.  I had a lot of left over materials after my install, which I will keep for later projects, but its' something to keep into consideration.\n  4.  I understand that this kit is a 1 size fits most and it did have everything I needed to finish my install...so it's not bad.\n  5  I would also suggest they include some metallic duct tape to seal of all of the connections and I also used it to tape all of the wires to the plenum for a cleaner looking install."}
{"rating": 3, "review": "Did not quite fit but does serve the purpose."}
{"rating": 3, "review": "This knob is not the same size as the original knobs out our Viking VGRC365, it is smaller.  Next time I need to check dimensions"}
{"rating": 3, "review": "These filters used to be all made in Eagan, MN. I recently purchased two GE MWF filters from and Amazon.com vendor and they arrived with stickers on the box covering up where it says made in the USA. I learned that GE sold their water filter division to SUEZ in March 2017 I called the GE answers line and confirmed the filters are not made exclusively in USA. They are now made all over the world."}
{"rating": 3, "review": "It replaces the original knobs which are just as cheap and thats the reason why they need to be replaced every so often  Jennair really needs to make a better knob to begin with."}
{"rating": 3, "review": "Water filter works just fine. Easy to figure out which one I needed. Gave 3 stars because customer service sends too many emails asking for reviews."}
{"rating": 3, "review": "Ge refrigerators are too smart!  They won't work with a fake"}
{"rating": 3, "review": "Wished the windows were painted so it looks like the light is on inside the house. I use a highlighter and yellow paint to achieve this."}
{"rating": 3, "review": "Usually within a degree or two of actual.  I keep two of these (different brands). The other is not as accurate.  Easy to set up."}
{"rating": 3, "review": "Worked great for less than 1 year, then died. I'll buy another one from someone else."}
{"rating": 3, "review": "Thanks."}
{"rating": 3, "review": "Filter works but is difficult to remove and attach. I almost broke my fridge trying to remove the last one of these I ordered. That can't be normal."}
{"rating": 3, "review": "Works well, but the delivery caused a few bumps on the housing. The sealing strip let's a little moisture in along the side causing some frost buildup along the door seal. It is definitely worth the price."}
{"rating": 3, "review": "One of the plugs on the back was broken but it still holds the wire harness ok."}
{"rating": 3, "review": "I was hoping this was more of an OEM-like replacement; its ok, but not perfect.  Water does not drain through it fast enough.  It's not a clogged drain issue, the older / original one worked fine - water drained from the skink into the drain through the older one just fine, but this new one, not so much.  It's like the holes are not big enough or something.  I used an exact-o knife and cut a few of the little holes on the outside perimeter to be a little larger and that helped my situation.\n\nIt does fit nice and tight in our Sinkmaster, so that was nice!"}
{"rating": 3, "review": "Worked ok until the Amazon 30-day return period expired, then stopped making ice. Amazon to be commended for taking the return anyway. I have purchased another unit hoping for better performance. It's been less than one month - so far it's ok. We shall see...."}
{"rating": 3, "review": "Pros: Stylish looks. Easy to control lockout feature for children. Stove top heats up really fast.\n\nCons: Preheat doesn't get to desired temp after alarm goes off. Can't have timer and clock on at same time. Exhaust fan is right where you stand so you're constantly getting air blown on you.\n\nI like this stove. It's not worth the price the big store chains are selling it for ($2000+) but for the price I got it at, it's worth it. I really like the lockout feature so my children can't accidentially turn it on without me knowing. The top burners heat up super fast but the glass stays really hot for an extended period of time after they are off. Way too long for my standards. The exhaust blowing is directly where you stand making it so if you're cooking at the stove, you constantly getting blasted with air right in your face. If you're cooking a pizza or something else that has strong odors, you're going to get that odor on your clothes. Whoever thought this would be a good place to vent should be fired. Also the preheat feature doesn't go to your desired temp when the alarm goes off. I preheated the oven to 425F and the alarm went off at 225F. So I had to set it on bake to 425F to get it the rest of the way. The fans stay on the entire time it's cooking and for about an hour after the stove is turned off. It's not very loud but if you're in the kitchen you will hear it. Overall I have some good points and some bad points. I would be very mad right now if I bought this at Lowes or Best Buy for full retail price but I didn't.. got it much much cheaper at a smaller chain store. So overall I'm happy with it. I just wish that exhaust blower was in a different place. It would be almost perfect if it was.\n\n*EDIT* After one year and three months, the internal cooling fan, the fan that blows the air at your body when you're standing at the stove, well it now sounds like it's off centered or not aligned correctly.  It rattles and shakes and super loud.  Really glad I bought an extra three year warranty with it when I bought it.  Repairman came over and knew exactly what is was.  He had to order the part so it's not fixed yet but he said I was lucky to have an extended warranty because this repair would have cost me $400-$500 to do.  He has to take apart almost the entire stove to get to this fan.  I got the extended warranty only because there are so many electronics on this stove.  It's not like a stove from 20 years ago that's mostly mechanical and doesn't break down.  I knew the circuit board's would be costly if they needed to be repaired.  Well worth the extra $129 I spent on it."}
{"rating": 3, "review": "waiting for other piece to see if this works, but delivery was at least reasonable"}
{"rating": 3, "review": "it's okay I was look for a pan that seat at the bottle"}
{"rating": 3, "review": "Obviously it is what it is and there are no other options. But because of that you're stuck paying the ridiculous price tag for a simple filter."}
{"rating": 3, "review": "This is ONE item.  Not a pair.  My wife was not aware, so now we pay to buy another one.  Otherwise nice. Pretty wide, but that helps if the elevation of the counter and the stove are not the same.  Corners can be a bit sharp."}
{"rating": 3, "review": "Moderately helpful in reducing white dust. Still replaced the electrostatic humidifier with a warm mist humidifier and Eli I acted the the problem."}
{"rating": 3, "review": "Was more difficult to install than it should have been.  Once I got it on, it seemed to work fine."}
{"rating": 3, "review": "When i put it in the light on the fridge stayed red. But the water and ice taste great again so I guess it is working"}
{"rating": 3, "review": "Fits a bit too snug- got to jam it in & it turns the water emerald GREEN, BUT after refilling the humidifier a few times the green wears out & the water is clear- hope it NEVER leaks when the green dye is fresh, otherwise GREEN RUG!"}
{"rating": 3, "review": "Cost is little high but it does the job. This is my 2nd one."}
{"rating": 3, "review": "The part functions perfectly but arrived without black facing pictured above.  We had to remove cover from old part and apply it to new.  Without black cover, lights make no sense as cover indictates temperature of fridge or freezer, child lock on or off and whether ice maker is on or off. While prying off facing from old part and attaching to new wasn't a big deal, it should not have been necessary."}
{"rating": 3, "review": "This vent pipe extension was key to proper fit for the entire tankless system"}
{"rating": 3, "review": "I've answered this 3 or 4 times now!!"}
{"rating": 3, "review": "It was useful for filling growlers and bottles until I upgraded to Perlick faucets. Sadly it doesn't fit my Perlick 525ss'. I like the Perlicks more than the little added convenience of using this when filling growlers and bottles."}
{"rating": 3, "review": "This product is listed as a newer version of a product I've purchased in the past. The \"new\" product contains only 1/20th of the active ingredients of the \"older\" version. The ingredients are exactly the same, just much much less of each in the \"newer\" version.\n I highly recommend purchasing the earlier version by Holmes. The bottles look exactly the same but rather than the \"Sunbeam\" logo in red the superior product has the logo \"Holmes\" logo in black.  The prior version is about 50% higher in price but one would have to use twenty times as much as the newer version to equal the strength of the of the Holmes version.\n\nAs always Amazon handled my concerns superbly with the most amazing customer service."}
{"rating": 3, "review": "They do the job. Not sure how long they will hold up."}
{"rating": 3, "review": "Works well fits my whirlpool frg but one cracked not long after receiving it"}
{"rating": 3, "review": "I 'm moving and wanted the range area to look good for buyers.  This filter came as expected and fit correctly.  The aluminum frame, however, is flimsier than the one it replaces.  Because it came in a bubble envelope and the frame was dented in several places I deducted a star.  I don't have time to return it and know I'd need to pay more for a better quality filter."}
{"rating": 3, "review": "I keep mine set about 2/3s of the way on the power setting and that is cold enough. Swapped out the fittings for ball lock/ home brew fitting and it works great for that. I could not buy a fridge and build something for this price. Holds 2 kegs with ease, but a third might be tough. It is a little loud though, and not insulated to a high degree so it seems to run very frequently."}
{"rating": 3, "review": "Decent item, didn't do it's job well. Get what you paid for."}
{"rating": 3, "review": "My fault - I ordered wrong filter."}
{"rating": 3, "review": "It fit adequately into the humidifier, it may be slightly taller than the original filter, because the cover of the humidifier would not seat down all the way, it was resting on the filter. But after the filter was wet, the cover settled down into place."}
{"rating": 3, "review": "Ironic, the review above had to cut it down.  For me, it was too short.  Lesson: measure 1st.  The shorter ones ar for doors on the freezer side of my model, while the longer ones are for the refridgerator side. Other than my own mistake, its a good item as described."}
{"rating": 3, "review": "Seems OK so far."}
{"rating": 3, "review": "Good fridge but you need to buy a new $55 filter at least every six months minimum in order to use the ice / water dispenser. So plan on spending at least an ADDITIONAL $110 plus tax plus shipping every year. I could not find a way to operate the ice / cold water dispenser without an in-date filter. The water in our area is fine without filtering. This feels like price gouging mascerading as \"convenience & technology\"."}
{"rating": 3, "review": "Had a crack on the old ice tray.  This worked but I wish I could have just bought the tray and not the whole assembly."}
{"rating": 3, "review": ""}
{"rating": 3, "review": "They don't fit between my stove and new Cabria stone counter top.  So now using along the side of the deep freezer and the wall so dust bunnies stay out of the gap."}
{"rating": 3, "review": "Product nice, but it came in damaged and no screws were offered with product. Trip to hardward store I guess."}
{"rating": 3, "review": "The directions to hang the transmitter outside in a place out of direct sun with good airflow around it. They suggest hanging it from the limb of a tree. However, the same directions state the transmitter should be kept out direct contact with the elements. Not sure how I am going to accomplish both so I have yet to hang it outside. I have confidence that once I find a good spot it will work well."}
{"rating": 3, "review": "They don't close very tightly; if there's wind, I often get cold air coming in through my hood, but given the hood size I needed large diameter and didn't have room to put in a separate damper. On the other hand, the outside is low profile and looks ok."}
{"rating": 3, "review": "It did cover the prongs successfully; however does not appear that it will be a durable finish."}
{"rating": 3, "review": "Fits my fridge fine. The white top was dirty and had a crack."}
{"rating": 3, "review": "Nice, but a little slow with making the ice."}
{"rating": 3, "review": "Ok, noisy at all speeds, seems to move air well."}
{"rating": 3, "review": "Needed to be calibrated to be used, if you have the calibration solution containers already this will be good for you."}
{"rating": 3, "review": "This thermometer/hygrometer is fairly precise but not accurate. There is no ability to recalibrate the device unfortunately, so you just have to figure out how off each one is and do mental math to figure out the proper temp/humidity in the room."}
{"rating": 3, "review": "Contractors hated installing it but it looks good to me. The fan noise is fairly loud. The led lights are bright but I would prefer they be white not blue. There is no 'on button', you need to turn it on with the timer. The lights on light on the touch panel is piercing. Very easy to clean."}
{"rating": 3, "review": "Do your math...the 3 pack is over 3 times more than buying 3 single ones. GE Appliances sells 3 pack for $119.97. Go figure......but the single one at GE costs more than Amazon's.\nThe filter works fine for me lasted 1 year as my water is very good.....very little minerals in it."}
{"rating": 3, "review": "The size of QC hose size in 3/8\" rather than 1/4\". If you intend to use the QC hose connect to a RO system drain pipe, it may not work at lease for Home Master products because the drain pile is 1/4\". It seems that the product use the inner diameter rather than outer diameter. For 3/8\" pipe, its inner diameter is about 1/4\".\nFinally, I have to cut it and use the main hose to connect my dishwasher drain pile after removing the air gap (I need to use the hole for RO faucet). For RO drain pipe, I followed the installation manual drill a hole on draining pipe although I don't like this way (too tricky and may break code)."}
{"rating": 3, "review": "This ice maker was shown on the Amazon web site below the new refrigerator that I bought, so one might assume that it would fit that refrigerator however the electrical connector did not connect to the connection in the new refrigerator. When I contacted the seller they said that that Ice maker is only for a 24\" refrigerator. Could not get any help from Whirlpool or the sellers so I had to go to an electronics store and buy matching connectors and install them on the ice maker and the refrigerator, other than that it fit fine."}
{"rating": 3, "review": "Good brushes, but one was damaged upon arrival"}
{"rating": 3, "review": "This model has been replaced by a new model. Great price. But I would invest in the newer model."}
{"rating": 3, "review": "Combo-Wall oven is a great addition to our kitchen; makes cooking fun and easy to use.  Baked foods taste and look better now. The convection oven is so much better to bake with. A month later I'm still waiting for my receipt in order to verify my warranty."}
{"rating": 3, "review": "Thanks...."}
{"rating": 3, "review": "Obviously does the job, and equally obviously, double the price it should be!"}
{"rating": 3, "review": "Ok for light clothing only."}
{"rating": 3, "review": "As many reviewers have said, this is a great ice maker!  Some reviewers mentioned that the machine is loud...making knocking/tapping sounds as it runs through its cycles...a problem we continued to experience.  After replacing the icemaker once, and fussing around with the gears and freezer temperature, I revisited some of the informative customer reviews (there seems to be no obvious way to contact the manufacturer).  After digesting all the information I'd accumulated, I reached the conclusion that the ice cubes were too large for the machine to easily heat, release and push out to the bin.  To make matters worse, the instruction sheet directs you to increase the fill time/ice cube size!  As a result, the gears slip (knock-knock) and eventually the mechanism fails from the stress.  The solution:  remove the front cover and turn down the fill time/cube size by turning the adjustment screw clockwise, moving the adjuster to the left (toward the minus marking).  I moved it as far as it would go without forcing it.  End result:  ice cubes are smaller (and plentiful), the process is quiet, and...the machine is happy (as are those of us who did not welcome hearing knocking sounds at 2 in the morning).\n\nUPDATE MAY 17, 2018:  before long the noise issues returned and ice production slowed to a crawl.  After suffering through two of these machines we decided to take a chance on the identical-looking one with a different part# (241798224 Ice Maker for Frigidaire Refrigerator).  For some reason...this different part # machine works perfectly...runs quiet and produces lots of large ice cubes 24/7 until the bin fills to capacity at which time the maker switches off.  All this, and it costs less too!  We may buy a backup to support our 30 year old Kenmore!"}
{"rating": 3, "review": "Belt was a little more narrow than original"}
{"rating": 3, "review": "As good as they are, I just wish you didn't have to change them so frequently. I know it's because of the nature of wick-style filters, but with a young child in the house, it's better to change them more often than not."}
{"rating": 3, "review": "The chute was leaking from a bad seal. This replacement worked very well. It was a little tricky to put in ,but now works fine."}
{"rating": 3, "review": "I like the facts that the tap works well and it keeps the beer cold. I dislike the poorly designed casters, as when you try to just snug the bolt in them, it compresses both halves together against the bearings, which in turn does not let them swivel. I like the fact that it will hold a 1/2 keg. I do not like the fact that the bottom bows under the weight of a 1/2 keg, which causes the door to sit at an angle and the seal will not seal at the top without a bungee cord on it. The unit was full of dust inside and out and dented on the top and the paint was chipped off, but there was no damage to the packing foam, the factory box, or the overpack box. This makes me believe it sat in a warehouse uncovered, and was packaged after it was damaged. I was not willing to return this and take a chance on getting another damaged product. I am satisfied with its operation but I think for the money this cost it could have been made a little sturdier."}
{"rating": 3, "review": "Not very cold. You have to keep it on Max setting for adequate coldness."}
{"rating": 3, "review": "Great product but they need to include more rods in the kit. I had to buy a second set of rods and that still wasn't enough so Ill end up spending $60+ dollars on this kit which isn't terrible if you factor what you would get charged out in town, but still, its plastic rods with a brush attached....thats overpriced for something so simple.\n\nSo enough of me complaining about it being overpriced and get to the review. It works GREAT if you aren't an idiot and use common sense when using it.\n\n1.  Always CLOCKWISE..... again always CLOCKWISE, I cant be anymore clear about this.\n2.  Use electrical tape or duct tape as a backup in case you screw up on number 1 above. Its a good safety measure so just do it, it only takes a few seconds per rod to wrap in tape.\n3.  Feed one rod at a time, taping each one as you go.\n4.  Dont force the rods if you get resistance with the drill attached. If you get resistance, remove the drill from the rod and using your hands wiggle/shift the rods until you get past the resistance and then reconnect the drill and continue. Most likely if you reach resistance is likely one of two things. (1) You have a large bend in your duct or (2) you have a lot of blockage. If its number 2, start pulling the rod out (with or without the drill attached (if the drill remains attached, remember to always spin  CLOCKWISE) as youve probably hit a patch of lint clogged heavily in one area. Pulling the rod out will likely pull a large portion of lint youve broken loose out with the rod and brush  attachment so vacuum it up or blow it out if you have a leaf blower and then start again (I didn't disconnect rods during this step but I did take my time to hand feed the rod and brush back in to ensure I didn't damage the rods).\n5.  Once youve reached the end of your vent, start pulling your rods out the same way you went in (CLOCKWISE) so that you catch any debris you might have missed on the initial cleaning.  I pushed the brush through 2-3 times in total from different sides of the vent since I was short a few rods and used the leaf blower 4-6 times in between to ensure I was pushing any lint to the exterior of the house (never blow the leaf blower into the house, only blow to the outside of the house unless you want a HUGE mess in your house.\n6.  Lastly, Id recommend using a face mask/respirator mask as this stuff is messy and you don't know whats growing in it. I had some cheap carpentry mask but will use a better version next time I clean it as its not fun to breath in."}
{"rating": 3, "review": "This part was slightly different in appearance than the original.  It had two or three extra protrusions on the rubber where some other hoses (for steam?) connect on different models.  I assume it is okay since they aren't open, but I wasn't expecting that."}
{"rating": 3, "review": "Economical.  Thinner, slightly cheaper quality than what I used to get in the store, but can't find a local store with them. Regardless, it does its job well.  I treat it gingerly while setting up a replacement."}
{"rating": 3, "review": "Really like the fact it fits on counter next to sink (even though i've very limited counter space).  The convenience of having it right next to the sink allows the attached hoses (fill & discharge) to work as they should.  I noticed other reviews included displeasure with the hose features.  They are not the highest quality hoses, but they do work as they are supposed to when used as they are meant to.  A little common sense would suggest, upon removing product from box, and reading instructions, that the fill hose is not meant to handle a whole lot of intake pressure from the faucet, but if you don't need to fill the washer in five seconds, a moderate water pressure from your sinks faucet is advisable. Clothes came out much cleaner than I expected, and even though there is no spin cycle, this little panda does not disappoint when it comes to getting things clean."}
{"rating": 3, "review": "Good quality item, and made in the USA.\n\nI would have kept it if I had another use for it, but when I bought it, it was listed (incorrectly) as a dryer duct, and I had bought it for that purpose.\nBefore I could install it, I read that dryer manufacturers don't recommend plastic ducts (including many \"foil\" ones that are actually made with plastic).\nI contacted the duct's manufacturer to be safe and they told me, emphatically, that it is only meant for cool air, like from a bathroom vent fan.\n\nSince I still needed a dryer duct, and wanted it to be fire-rated, I got this one.\n<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/Quadriflex-Quick-Connect-Dryer-Venting-8-ft-DK8S-UL-2158A/dp/B00908SHWQ/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">Quadriflex Quick Connect Dryer Venting 8 ft - DK8S UL 2158A</a>"}
{"rating": 3, "review": "As good as the one that came with the fridge.  That being said...it's far from good!  The fridge is junk, and we will replace it as soon as we can.  We ordered 2 of these 9 months ago, and one of them just broke a couple of days ago.  I don't think we're significantly more hard on the fridge than your typical family of 6, but we have had SO MANY parts of this thing break!  I did just order another one of these to replace the one that broke...again.  Until we can replace it, these are an affordable option to keep it functional!"}
{"rating": 3, "review": "I buyt thus for the one gallin of Dr Pepper, although it dud wirk. It leakes. So I don't use anything, just tilt box slightly till syrup cpmes out. Then reinstall the dust cover."}
{"rating": 3, "review": "Let me first say this machine cleans and dries my clothes amazingly. Most loads, with the drum 75% full, are totally dried in under 3 hours. I use the low temp drying because otherwise this will shrink my clothes! Clothes come out warm and totally dry. I did cut down my wall stand pipe and I have the unit on a pedestal. I do not think a floor drain is necessary, but it is possible that the drain hose routing is critical. Make SURE the exit of the drain hose on the machine is the highest point on that hose's route to your drain pipe. Otherwise it is possible water will flow back down towards the machine and cause some of the drying issues. I don't think it is necessary that the hose always is routed downward, it just cannot have a higher point than the machine's outlet. I should note I am in Colorado, where the air is very dry, and I think this probably aids in the drying.\n\nSo, my clothes are clean and dry, and no need for a dryer vent. It is also clear this uses very little water. That makes me happy.\n\nHere is what makes me unhappy. In order of priority.\n\n1. There is a small vent near the water hose connections on the rear that emits steam while in the dry cycle. Enough such that condensation is all over my wall and water drips on the floor. LG service is absolutely horrible - 2 people have said nothing should be coming out, 2 people have said it is normal including the tech they sent. (I'm not sure the tech had ever worked on a machine like this...) From what I can find online, the vent should have a check valve on it to let air in, but not OUT, such as during drying.) So LG came out and said it is normal, but I don't know what the truth is at this point. Ridiculous for a machine this expensive! I will update this review as I find out more. In the meantime this is going to mess my wall up due to water damage if I don't find a solution.\n\n2. There is a HORRIBLE smell coming out of this thing for the first 6-8 dry cycles. Run some old towels or something. Not clothes you care about! It will go away, but until it does the smell will get on whatever you run through it. The manual states \"odor\" in troubleshooting, and the answer is \"new machine.\" But it should be more explicit. Do not run clothes you care about, they will be ruined.\n\n3. The \"cute\" sounds and songs it makes are actually terribly annoying, and there is no way to turn them off. The cycle finished song is absurdly long.\n\nAnyway, I can get past all of this except the steam coming out the back. If I can easily fix that I will say 4 stars. Until then this machine is meh with some distinct annoyance at the price, considering the issues."}
{"rating": 3, "review": "I was happy to find this since it came with 3 small, 1 large. I bought them for my apartment's small stove before we moved out. The smalls fit perfectly, but the large one was too big!  I thought drip pans were standard sizes. I recommend measuring first."}
{"rating": 3, "review": "Water Taste is a little different than the original Samsung filters but you get use to it in few weeks."}
{"rating": 3, "review": "I got this last year and it work pretty good for a while. I ran it 24/7 since I got it 4 months ago it started making a really loud sound when it started filling up with water so I ran a ice maker cleaning solution through and couple of time and it seem to help But then the try that  fills with water crack where it connected into the sides of the ice machine and the water tray will not come up and fill with water now. If you get one be sure to get a extra warranty with it. This one only lasted a Year so you better get a 2 year warranty with it if you purchase one."}
{"rating": 3, "review": "UPDATE - One Month later:\nI continued to fuss with this for a couple more weeks, convinced that my flooring was the problem, and that the problem was NOT the LG WM3470HVA washer / DLEX3470V dryer pair. I pulled up the pavers and appliances, and then installed another layer of 3/4\" flooring plywood over the existing floor. I tried the pads again. Despite all of this, I was still getting an unacceptable amount of vibration during certain RPM ranges of the spin cycle. I pulled the washer and dryer off of the pedestals. This helped quite a bit (maybe 50% better), but I still could not believe that a thousand dollar washer could be this noisy. I complained to LG who, to their great credit, agreed to replace the washer. The new one was slightly worse than the first!! I complained to Home Depot, from whom I had purchased. To THEIR great credit, they agreed to come pick up the set and to give me a full credit.\nI went to a local brick & mortar appliance store, with whom I had done past oven and refrigerator business, and was impressed with the Electrolux Series 60 IQ-Touch washer and dryer -- including the Electrolux Second Floor Guarantee. We made a deal, and opted NOT to include the pedestals -- for several reasons over and above the potential for increased vibration (especially the loss of the folding/work area on top of the W/D set and the difficulty in reaching overhead cabinets).\nBottom line - no reinforcement with pavers or plywood, and QUIET and STABLE as expected. Also, the Electrolux pair actually seem better than the LGs in every way except two (not TRUE steam and the door can not be propped slightly ajar for air circulation). Other than that, we like them much better (even if not for the vibration issue alone).\n\nORIGINAL SEPTEMBER REVIEW:\nWhile these types of products (original review was for a similar product) appear to have worked well for some . . . not at all for others . . . and only marginally for the rest (including me, subject appliances being a new 2012 LG Front Load Washer and Dryer), here are some things to consider about anti-vibration dampers/shock absorbing feet in general, and Front Load Washer vibration specifically.\n\nFront load washers, especially when mounted on the fancy factory pedestals (which compound the problem by throwing the center of gravity up another 15 inches), are of course ideally designed to be located on a basement/garage concrete slab. The downward force of the spinning drum is exponentially greater that that of a top load machine (which spins outward), so if you are locating your appliance on a first floor (or worse, a second floor), you're very likely going to have to just live with some vibration -- either of the floor and adjoining walls, or the unit itself. The anti-vibration dampers such as those being reviewed here attempt to minimize the former (floor vibration) at the expense of the latter (appliance vibration) -- which can cause the FL washer to buck like a bronco and constantly re-seek a balanced load. Not really an ideal tradeoff.\n\nThe simple key, however, is to try to mimic a stable concrete base as closely as possible -- which can be done pretty effectively on a first floor installation, and to a lesser extent on a second floor. Remember that we're most likely dealing with a 3/4 inch plywood subfloor over 2x6 joists spaced at 12\" (or perhaps worse in some construction), and that unless the four tiny circular feet of the washer (perhaps 2\" in diameter?) are resting directly over, or very close to, one of those joists (highly unlikely), the subflooring is always going to flex from the extreme downward pinpoint force coming through those tiny feet and cause floor vibration and shaking.\n\nWe need to increase the surface area of the four contact points so that more 'floor' is taking the pressure.\nThis can be done by reinforcing the floor -- not from underneath, but OVER the subfloor and UNDER the appliances -- with simple 12x12 concrete pavers from either of the big home improvement warehouses (nominally sized at approx. 11.75 x 11.75 x 1.8 inches or so). Five pavers across the front (two are for looks only), three across the back. The combined width of a washer plus a dryer is very close to the combined width of five of these abutted pavers.\n\nIn the front, (and assuming a washer on left and dryer on right) the legs of the washer sit on pavers 1 and 3, and the legs of the dryer sit on pavers 3 and 5 (note that this reverses if dryer is on the left, and that in any case the #3 middle paver supports the innermost leg of each of the appliances). For a consistent look in the front, space the three load bearing pavers such that pavers 2 and 4 fit perfectly between the load bearing pavers 1,3 and 5. In the back, mimic pavers 1, 3 and 5 from the front.\n\nThis is the approach I took after dissatisfaction with the anti-vibration/damper feet approach, and it has made a veritable world of difference. Is all vibration gone? No, the washer still vibrates a bit at a particular spin speed range both on the way up and down, but it is vastly decreased and eminently tolerable considering the alternative of moving the entire laundry room to the slabbed basement. The efficiencies and conveniences of the FL washer are are an acceptable tradeoff to the admittedly quieter spinning top load machine that served us well for 20 years.\n\nOne last tip - What if you need to do this in situ, i.e. without moving the appliances out because of a tight fit or other inaccessibility. It's a bit more work, but can be done (even by yourself, but a helper is better). You need two scrap 2x4s, and two scrap 1 x4s -- each about 6-7 feet long. Cut off enough material from the ends of your lumber to make four approx. 3-inch long scrap platforms for the front appliance legs to be temporarily raised and rest on. These small platforms need to be the height of one 2x4 end plus one 1x4 end stacked and screwed on top -- for a total nominal height of 2-1/4 inches off the floor.\n\nTilt the washer backwards and put the two 2-1/4 platforms under the two front feet, allowing it to settle on the platforms while tilted backwards. Do the same with the dryer. Now mate the remaining 1x4s over the 2x4s with screws, such that you have an approx. 5 foot lever that is also 2-1/4 inches high off the floor. Rock the appliances forward towards you on the front platforms while jamming (if alone, pushing with your foot) the lever all the way back as close to the very middle of the appliance as possible such that when tilted backwards again, the appliance balances on its front two feet and its middle rear over the lever. The appliance will be elevated at three points about 2-1/4 inches above the floor, giving you space to place the 1.8\" pavers under the BACK feet. Now do this same procedure with the dryer, and use a broomstick or similar extension to push the three pavers under the now-elevated back feet of both the washer and dryer. Again, the middle paver #3 needs to support the innermost feet of BOTH the washer and the dryer.\n\nOnce the rear 3 pavers are placed correctly, rock the appliances back forward again onto the front scrap platforms in order to remove the levers, then back again to rest on the rear pavers. Now rock them further backward to remove the front scrap platforms and replace with pavers under the front feet, carefully spacing so that pavers 2 and 4 abut with load bearing 1, 3 and 5.\n\nDone! Hope this serves to help you!"}
{"rating": 3, "review": "First of all, this is a Maytag product.  They just put the Jenn-Air name on it to sell it for more money!  This cooktop is not worth the money.  I admit I prefer gas cooking, but this thing takes forever to heat up, doesn't seem to get hot enough, and doesn't have a setting to tell you if the burners are still hot after you turn them off.  I can't tell you how many items we've melted plastic because someone set something on a still warm burner.  But the REAL reason I hate this cooktop is how difficult it is to clean.  Yeah, it might be fancy with the modules, downdraft vent and grease catchers, but it is horrible to clean.  Each module has gaps around it, so the module insert itself gets grease and grime on the edges, then the insert underneath it, then the main cooktop frame and housing.  Not only that, but the incredibly bright (sarcasm there) people who designed it didn't allow for the downdraft shaft to be removed for cleaning.  And you can't get to it with your hand (unless you have your kids do it!)  You should see the undidentifiable food items down there.  I can see some arborrio rice, but the rest is just yuck.  So, if you cook a lot and like to clean even more, this cooktop's for you.  I suggest going for a better conventional cooktop (but still less than this baby)and using a George Foreman grill or your outdoor grill. But if you still think you want this one, I have one to sell you! :)"}
{"rating": 3, "review": "The item fit my washer/dryer perfectly but was missing the sticky strips in order to install it. We were able to use other padded sticky tape in order to install but was not happy it didn't come with all the correct pieces"}
{"rating": 3, "review": "It is a ok board, too light and not real wood"}
{"rating": 3, "review": "Since I started using this my fridge started icing up. The freezer side is unaffected. It may be coincidental though. When I bought this I bought three individual packs because it was cheaper than buying a 3 pack ???"}
{"rating": 3, "review": "Purchased to replace the drip pans in my Maytag 4000CSE electric cooktop that was installed in 1995.  I was actually kind of surprised to find these pans because it has generally been my experience that manufactures like to phase parts out after 10 or so years so that you have to buy a whole new appliance.  My cooktop still works, so I didn't want to have to replace it, just spiff it up a little.  I'm taking two stars off however because my original drip pans were solid and these have a large circular opening in the bottom.  That means when things accidentally spill or boil over, it makes a mess inside of the cooktop underneath the burner pans.  My original pans had a solid design that was nicer - it kept the spill inside of the drip pan and meant less clean up."}
{"rating": 3, "review": "Magnetic strength is very weak.  The cover is exactly the size and purpose I needed, but I had to use thumb tacks to make it stay."}
{"rating": 3, "review": "Item was what was needed for the repair. Actually just needed the spring so transferred it to the existing hinge and it worked as designed. Keeping the unit for\nany future repairs."}
{"rating": 3, "review": "After fooling with trying to get the blower wheel off for hours (the square hole in the plastic wheel is stripped and the wheel seems to tighten itself in normal operation), we finally put the new motor and belt in and the door switch decided to stop working, then the dryer started smoking from the back...  So, we ordered a new door switch, and tried one more time.  The dryer got through one load (stopping several times during the cycle) but after that, nothing.  I don't think the problem is the motor, but I can't be positive, so I am going with a middle of the road rating.  And we got a new washer and dryer set..."}
{"rating": 3, "review": "my family, the \"water snobs\" use zero water and according to the tester the amount of elements is close to that as our tap water.  the taste is better but not sure of what all is being removed.  Honestly, have not done the same test with a factory filter."}
{"rating": 3, "review": "I bought thinking it was bigger. I thought it had indoor/outdoor temps and humidity. It's the size of a card (drivers license size). I guess it works well for what it's designed to do. Needs better, more clear product description."}
{"rating": 3, "review": "Look at reviews below .. works fine but very thin and paperish"}
{"rating": 3, "review": "Just ordered this part to replace the upper spray arm in my Electrolux model #GLD2445RFQ2 because the spray arm falls off about every other load.  My part is labeled 1544681 and does not look EXACTLY like the photo but very similar.  This part should fit according to amazon and frigidaire - I will update my review once it arrives and I confirm.  (photos are of my old/original part)"}
{"rating": 3, "review": "Used it for the non-ducted filter over my range (under the microwave ones). Since there was 3, i used 1 for my cats litter box as an air filter on top of it. It works....but don't expect zero odor. It removes just about 60-70% of the odor. Much better than nothing or standard filters."}
{"rating": 3, "review": "The drip tray itself is very well made and seems like it would be a great replacement part. Sadly it doesn't fit our 2010 GE Profile side by side fridge. The cavity under the fridge's water dispenser has two humps sticking up which interferes with the fit of the plastic piece that hangs down on the front of the tray."}
{"rating": 3, "review": "The burner covers themselves are alright.  They don't work with my stovetop but that is my fault as I should have thought it through more thoroughly.  My 5 burners are covered by two long grill covers and this just doesn't work for me to use these grill covers."}
{"rating": 3, "review": "Fits the space but doesn't clean very well"}
{"rating": 3, "review": "Lots of room for small freezer. Wish it defrosted itself. Would gladly pay more if it did."}
{"rating": 3, "review": "They work... I just don't get the 3 pack for a machine that uses 2 filters. Don't tell my wife, but I'm not a big fan of the humidifier itself."}
{"rating": 3, "review": "It came with few dents and needed to return. It looks beautiful!"}
{"rating": 3, "review": "It's a very sturdy piece but doesn't fit in my dishwasher very well.  The holes are to big and things slip through plus the latch is hard to open and close."}
{"rating": 4, "review": "Easy to install"}
{"rating": 4, "review": "Wasn't sure this would work in my Whirlpool Duet washer but package contained additional rubber feet.  Replaced the feet and it fit the same mounting holes as the old pump.  Works great."}
{"rating": 4, "review": "works well"}
{"rating": 4, "review": "replacement part.  just what i needed. thanks"}
{"rating": 4, "review": "We bought the replacement lint filter for our LG  -- the felt around the edge doesn't seem to be as thick or effective as the original.  Maybe they changed the design since I bought my units -- but on the plus side, I still LOVE my LG washer and dryer :)"}
{"rating": 4, "review": "Worked quite well , liquid could be thicker . but it saved me from having to replace a dishwasher which is still working well and has a short wash cycle"}
{"rating": 4, "review": "Fit perfectly in my FREEZER door. Just what i needed. Does not work for the top shelf, but it does for all the ones below."}
{"rating": 4, "review": "it is more quieter then the old bent up one , had to place large before and after the shaft to balance it better"}
{"rating": 4, "review": "Easy installation."}
{"rating": 4, "review": "Came on ups truck on its side (states on box not to lay on sides).\n Opened box and the door fell on the floor. I went to put it on and the brackets wouldnt hold it (spread to far apart).\nTHEN, i noticed every corner was dented very bad.\nSeems to operate (cool down) 3 hrs unto using it.\nI attached pictures of the dents abd whatnot.\n\nDespite the tortured fridge appearance, it is a nice fridge with plenty of room and runs quietly. So far, its chilly inside. So, it probably deserves 5 stars if it was in good physical condition.\nThey just don't pack these things well enough to survive the careless handling by ups shipping."}
{"rating": 4, "review": "This brand increases significantly the white dust in hot steam humidifier.  The lack of this substance em itted is one of the main reasons for the heat steam mist units.  It helps reduce build-up somewhat."}
{"rating": 4, "review": "It was a good price but is already cracking around the edges of the screen"}
{"rating": 4, "review": "ok"}
{"rating": 4, "review": "works great, hopefully it holds up."}
{"rating": 4, "review": "Product fills the gap for a perfect fit.  But keep in mind when ordering this product it is for a single and not a pair."}
{"rating": 4, "review": "The one I received is plastic. I was expecting metal, but decided to keep it for now. It's held up beautifully and seems much sturdier than the typical cheap plastic ones. The finish is very nice and adds continuity to my sink. I would say what I received is a high quality plastic cover with a nice finish. I've had it for one year and it's held up well, even with some scratches. Nearly looks like it will patina. I'm having difficulty adding photos, but I will add some when I am able."}
{"rating": 4, "review": "my rack looks good now that i used this"}
{"rating": 4, "review": "I was pleased with the quality and will purchase another one. The unit is good gauge steel and the flapper has a nice seal and spring load."}
{"rating": 4, "review": "Thanks!!!"}
{"rating": 4, "review": "Thanks.  Works great."}
{"rating": 4, "review": "Totally fixed our issue and it's like we have a brand new dryer."}
{"rating": 4, "review": "Prompt. Working as expected."}
{"rating": 4, "review": "Used these to upgrade the dampers on my Samsung washer. I believe they changed the design a couple years ago. I had the old weak dampers. I noticed a significant difference in vibrations and stopped getting the imbalanced load error.\nSimple to replace with household tools. Took me about 20 minutes. Plenty of videos showing how to change.\nWould definitely recommend if your Samsung washer has vibration issues."}
{"rating": 4, "review": "Looks wonderful, be nice if it came with a power cord. No matter. Looks great in my kitchen very happy"}
{"rating": 4, "review": "Fit perfectly no problem  and work ok now"}
{"rating": 4, "review": "Watch you tube for instructions.  Item worked fine."}
{"rating": 4, "review": "it was just fine"}
{"rating": 4, "review": "not an exciting part but does the job"}
{"rating": 4, "review": "Perfect for my need.  Ice maker wouldn't run, but found that shooting any other IR beam into the receiver would make it run.  The sending board was my problem.  Easy to change out."}
{"rating": 4, "review": "As advertised"}
{"rating": 4, "review": "Does it's job"}
{"rating": 4, "review": "Bought this for my 85 year old mom for her personal items.  She loves it just wishes it dried the clothes more"}
{"rating": 4, "review": "Piece came as expected."}
{"rating": 4, "review": "Works fine 3 for the price of 1."}
{"rating": 4, "review": "Once we figured it out, worked just like is should have."}
{"rating": 4, "review": "Watched YouTube video on how to install. super easy."}
{"rating": 4, "review": "works fine"}
{"rating": 4, "review": "Perfect in a timely manner but kinda expensive. $22"}
{"rating": 4, "review": "I just got my washer today and so far i love it. Ive washed a months worth of clothing already and its left everything clean and fresh. I have to say the only reason I didn't give it 5 stars is because of the noise. I live in an apartment building where I'm not allowed to have a washer in the apartment but the ones they provide in the basement are disgusting and I'm tired of carrying heavy loads of clothing and sheets to the nearest Laundromat. I hope i can find a solution for the vibration soon before someone complains about it.  I recommend it for a single person like myself. Also, it is not the kind of machine you load and walk away from. It requires a little more work. I suggest looking at the youtube videos on how to use it. it helped so much!!"}
{"rating": 4, "review": "Love this product I have arthritis and it does all the work. I wish the brush was a tad smaller. but it works as expected. I can finally do my own hair."}
{"rating": 4, "review": "Worked well with my cookie not a five but it did the trick of working my attic"}
{"rating": 4, "review": "Apparently this part needs to be replaced periodically. I couldn't beat this product at this price. It installed easily (in under 5 minutes) and I was washing dishes in no time. The only downside was the part is manufactured just like the original that came with the dishwasher, which means it will probably need to be replaced in another 3 to 5 years. However, it's nice to know that it is an easy fix if it does break."}
{"rating": 4, "review": "This product has worked very well for me.  Some raters have complained that they see no change in color when the product is humid.  I can see this.  The color change is more subtle than dramatic and perhaps that's why they didn't see it.  But it's there if you look carefully."}
{"rating": 4, "review": "Bought 3 of them for my MoistAIR humidifier, and they worked fine for a few weeks, then I got a \"Change Filter\" beacon on my humidifier which I thought was weird since the filter was less than a month in the machine, but I changed it anyways and the beacon still has not gone off. I think these filters are meant to work with different humidifiers and not with moist air ones, my humidifier is still working, but it isn't recognizing that I have a perfectly good clean and new filter in it."}
{"rating": 4, "review": "It is working good."}
{"rating": 4, "review": "did the job"}
{"rating": 4, "review": "Easy to install - follow the directions"}
{"rating": 4, "review": "This works well but it doesn't keep starlings out. They can get in and build nests which can cause a blockage in a dryer vent which could become a fire hazard."}
{"rating": 4, "review": "I broke my dishwasher by overloading it and before my husband knew about it (he would tease me because I break everything), I ordered and installed the part the same day. It was extremely easy to install and reassemble the blade."}
{"rating": 4, "review": "This product filters as advertised. It doesn't dance or sing. It filters. If you don't want a water filter you're on the wrong page. Sorry."}
{"rating": 4, "review": "The machine works 10 times better than the Igloo it replaces. Two complaints would be the odd control panel which I've never seen anything operate like it, designed by aliens. It has a timer function that I could not make complete sense of. If you ignore setting the clock and timer like me I just run it manually. The second thing is an intermittent squeal like the fan bearing. It makes lots of ice, so I can overlook a few quirks. We'll see how long it lasts. I bought an extended Amazon warranty"}
{"rating": 4, "review": "Put it on my Maytag Epic Z.  Took me an hour to do all told, in order to get the washer apart and back together.  Price was right and worth doing myself, but they really ought to include concise specific instructions."}
{"rating": 4, "review": "worked as advertised"}
{"rating": 4, "review": "It would have been perfect except it is for a round top vent and I needed back rectangular.  I thought the description said that it was adjustable, but it was not.  So I had to return and order the correct one."}
{"rating": 4, "review": "Need to check performence kin six months. good value for the money."}
{"rating": 4, "review": "Exactly what I was looking for. Just glad that I was still able to find it as our cooktop is pretty old. Pretty price for a little knob, though."}
{"rating": 4, "review": "Filters  water and fits the fridge"}
{"rating": 4, "review": "It is my usual water filter that works with my GE Refrigerator just fine."}
{"rating": 4, "review": "works as advertised"}
{"rating": 4, "review": "Ordered this filter based on other reviews.  It came quickly and was well-wrapped.  I can't speak to how well it works as this is the back up filter and won't be using it for several months."}
{"rating": 4, "review": "fit great"}
{"rating": 4, "review": "Really powerful vent and really nice looking. Very easy to install. At the highest setting it does get pretty loud, other than that it's fantastic!"}
{"rating": 4, "review": "Unit arrived in excellent condition with no dents or dings/scratches. Excellent product. The only reason I deducted one star was do to a shipping mishap that led to confusion and a slight delay."}
{"rating": 4, "review": "This is a good twine for simple things around the house, but is tends to break if you are trying to tie up a serious piece of meat. As an Executive Chef I am used to high strength butchers twine at work, but this does the trick at home, just be careful, it does tend to snapped more easily than industrial grade twine."}
{"rating": 4, "review": "fits well, but over priced."}
{"rating": 4, "review": "Met my expectations."}
{"rating": 4, "review": "a little more flimsy than the original, but it gets the job done, and for less than half the price of the factory replacement."}
{"rating": 4, "review": "everything is great quality with the exception of possibly the regulator. maybe im using it wrong but it seems to let the pressure fluctuate a bit more than i expected"}
{"rating": 4, "review": "We super glued each of these on and let them dry before using.  A couple have fallen off but overall happy with their staying power."}
{"rating": 4, "review": "I needed a new weather station- the old one was starting to malfunction and I had become adjusted to having basic weather info at my fingertips. After much searching, I decided on the WX-11, because it showed a lot of data, it was colorful, and I could use a pool temperature sensor with it (purchased separately.) Everything was packed well and the instructions were easy to follow. I had both sensors up and running in just a few minutes. The numbers are big and easy to read, and I am waiting to see if the colors are helpful or a gimmick. I'm very happy I purchased this, but have two cons, one small and one larger.\n\nThe first has already been mentioned, but the company does not send a screw with the outdoor sensor. After some rummaging around, I found one that will make do, but it's a curious omission. The second and more serious complaint is the AC cord. I assumed it would be at the bottom or the back of the unit, but instead, it's on the side, making it pretty much impossible to hide. This clumsy engineering is the only real issue I have- other than that, works great!"}
{"rating": 4, "review": "haven't used it yet but i kow it's a wonderfu machine!"}
{"rating": 4, "review": "I have an old stove hood, so I'm just thankful I can still get these. They filter quite well, and last a long time."}
{"rating": 4, "review": "gets the job done"}
{"rating": 4, "review": "Has worked so far,  one month"}
{"rating": 4, "review": "The exact same model I needed. But it took too long to arrive"}
{"rating": 4, "review": "I contacted GE Customer Service to ask them which broiler element my model JBP26WV2WW range requires.  They looked it up and said I needed a model WB44X0185 replacement broiler element, which they would sell me for $75.  I found this item on Amazon.com for under $17.\n\nSome things you need to know.\n- First, the item arrived in only 2 days -- not the 7-12 days that was estimated.  The item was well packaged, arrived without damage, and also included 2 screws (in case yours are lost or too corroded to reuse)\n- Second, I read a number of reviews where buyers expressed frustration with the screw holes in the mounting plate not aligning with the original holes in the oven.  I did not have this problem.  The holes aligned perfectly, so either the manufacturer corrected their mounting template, or their replacement part is identical to the original.\n- Third, the electrical connections are not the slide-in type, but are the much more safe and secure screw-in type.  Installation is trickier, but I was able to remove the old broiler element and install the replacement within 30 minutes.  This included locating the right size tool to remove the 2 nuts holding up the ceiling mount, element mount, and electrical connections. (TIP: Before disconnecting the electrical contacts, wrap a long twisty-tie to each wire so that they do not slip back into the range.  If this happens, you'll need to remove the rear panel of your range and push the wires back through the opening and into the oven so they can be attached. There are several DIY YouTube videos showing you step-by-step procedures for replacing your broiler element. Oh, and turn off the electrical breaker before doing any work on your range.)\n\nWhile this replacement broiler element says that it will replace model WB44X173 and WB44X185 broiler elements, I can tell you that it's a perfect replacement for the model WB44X0185 part recommended to me by GE Customer Support (not sure why there's that added zero) and that the holes in the mounting plate align perfectly with those in my GE range."}
{"rating": 4, "review": "Perfect fit.  Wish the models that it works with would have been listed tho."}
{"rating": 4, "review": "It works! But I had to buy pantyhose to cover the grill because the first several times I used it without the pantyhose on, it shot lint EVERYWHERE."}
{"rating": 4, "review": "Good product . A satisfied customer"}
{"rating": 4, "review": "This is not like the original but it works. This is much thinner than I expected. I guess I would have to changed this more often."}
{"rating": 4, "review": "quick delivery, easy swap out."}
{"rating": 4, "review": "Working well so far and much less expensive that the original product from Sears for Kenmore.  Have no problems with this item.  Will order again when needed."}
{"rating": 4, "review": "On an absolute basis this wouldn't be 5 stars as things like the grease grills are a little flimsy, but this thing is very affordable and for the price, it's a great product.  No complaints since I installed it.  It's fairly powerful, the instructions were pretty complete, it came with a few extra nuts and bolts for assembling in case one gets dropped somewhere hard to retrieve.  I like that this company has wall mount and island mount versions of most fans."}
{"rating": 4, "review": "Exact fit. Holding up well so far."}
{"rating": 4, "review": "They discountinued the original piece because it broke a lot. This one does not always catch, I am afraid it may break if I shut te dryer door too hard or too quickly. I am glad I only paid $2ish dollars for it rather than the $24.95 Sears wanted. It's a good solution to extend the life of our otherwise crappy dryer."}
{"rating": 4, "review": "It was the part I needed (after thinking it was a bad control board) and worked for the model washer I had."}
{"rating": 4, "review": "great"}
{"rating": 4, "review": "Serves its purpose.  So far so good.  Quality not as good as original lint trap that came with the machine."}
{"rating": 4, "review": "We have an older kitchen with original appliances which can make finding things like filters a hassel. This one was a perfect fit and it exactly what we needed. It seems to be of better quality than the orignal that was still attached to the vent hood when we moved in."}
{"rating": 4, "review": "I read a lot of reviews from different sites about this product. There are some reviews saying it is hard to install so I didn't make my decision until this July. I got this machine from Amazon a few days ago. I read the instruction carefully before installed. The instruction and the product indicated how to place the plate correctly onto the bottom. This machine is perfect for 2 persons. The clothes dry easily because the spin is strong enough.  The machine is not very noisy, and understand it should have some kind of sound when it washes or spin.  I used the box which came with this machine to cover it because I don't want my apartment manager knows, and it help a little bit on the sound.\nI lived at the 3rd floor and my apartment doesn't have laundry. It saved my life a lot.\nAt the beginning, I thought that it would deliver by UPS but it was not. I tracked the package everyday to make sure I have someone standby to receive the package because it is a heavy case, over 60 lbs., I didn't want it returned. When I tracked the package was arrived the city, the shipping company will call or email you to contact them to arrange the delivery, I was so happy with it.\n\n(Sept. 12, 2010)  After 2 years, everything works fine.  Very important, don't put too much clothes in one load, after a few try, I know how to balance for every load. This mini washer machine is perfect to let me separate the colors of the clothes and my daughter's clothes in different loads. I can wash and do something else at the same time, and no more wait at the laundry anymore.  I love it."}
{"rating": 4, "review": "We have 24 foot of solid dryer vent pipe ending in 3 right-angles before going through the floor into the flexible dryer-vent hose coming from the dryer.  I can't get behind the dryer without moving both the washer and dryer and they are HEAVY.  So being lazy I decided to clean the vent from the outside of the house inward.  I didn't use a vacuum cleaner or a blower or suction of any kind.  I did tighten each section of tubing with pliers and taped them.  I threaded all 24 foot of tubing with the brush on the end into the outside vent and then backed it out.  I got a good amount of lint clods out.  Then I turned on the dryer to blow everything out.  I got no air coming out at all.  My fear had come true, I had forced gobs of lint into the right-angles at the end of the run.  I still didn't want to move that washer and dryer so I figured I'd try one other thing, use the clodbuster attachment.  Now I'm really getting lazy so I tightened each tubing section by hand (no pliers) and didn't use tape.  I pushed all 24 foot of tubing into the vent until I hit some resistance and then turned the tubing by hand (too lazy to hook the drill up).  Then I pulled it all out and there wasn't any lint at all that came out. So now I'm resigned to having to move the washer and dryer, but before I do I figured I might as well turn the dryer on and see what happens.  Lots of lint clods blew out and kept coming out for about 20 seconds.  I've attached pictures of it.  I'm really happy with this product and if it worked for me with all the shortcuts I took it will probably work great for you.  As a point of reference we built this house five years ago and this is the first time I ever cleaned the vent.  A load of ten bath towels used to take 45 minutes to dry, lately it's been taking 3 to 4 hours, so I knew I couldn't put cleaning the pipe off any longer."}
{"rating": 4, "review": "I like it"}
{"rating": 4, "review": "Right one that I needed."}
{"rating": 4, "review": "I am considering selling my w/d unit separate from the trailer and came here and decided to leave a review.\n\nI had a lot of frustrations about buying a washer/dryer that was so expensive for my RV.  RV manufacturers make the laundry closet so small that it rules out virtually every w/d available in U.S. stores.  These are 23\" (or a fraction under) wide by my recollection. They were virtually the only make that would fit in the laundry closet of my Open Range Fifth Wheel RV.\n\nMy manuals are in storage with the RV, so I'll go from memory on any specifics.\n\nLike all/most front loaders, this is an HE washer.  You MUST MUST use HE laundry detergent.  This is a low sudsing formula. There are lots of settings, much like on any full machine.  Compartments for detergent, bleach, fabric softener.  I recall the washer uses 14-17 gallons of water.  I had a 42 gallon gray tank for the bathroom/laundry.  I could take a shower and two loads, but the second load risked filling the tank.  Normally I dumped the tank every two loads (also after every two showers).  These are unlike combo units that don't have high speed spin cycle and don't vent the dryer.  The 1200 RPM spin for cottons gets them wrung out well and easier to dry.  The vented dryer is very efficient.  Talk to people with combo units and they complain that the whole wash/dry process takes many ours, 4-6 hours some people complain about.  That's because they don't have the high spin for cottons. Your cottons are wetter at the end of the wash cycle and the condensing dryer is more inefficient and will take even longer due to the wetter clothes. When the 1200RPM spin hits the entire trailer would vibrate.  You always know when the wash is winding down--all the chairs and sofa turn into vibrating seats. LOL\n\nThe dryer is great.  I use it to unwrinkle clothes.  I soaked and wrung a clean washcloth, tossed it in their with some wrinkly shirt and let it steam out the worst of the wrinkles.  It dried quickly and quietly.  I'm not an overly sensitive sleeper but I would toss wash into the dryer and go to bed with the dryer 8 feet from the head.\n\nAt home we have a new HE washer--it is terrible. I have to pre-treat everything. I find food stains on my clothes that the wash never gets out.  I realized that while living in the RV I never had that issue. Same clothes, same detergent, same sloppy eater--cleaner clothes.  I realize now, the machine machine is much better than the GE we have at home."}
{"rating": 4, "review": "Would buy again.  Fit perfect.  Slightly bent, but I  done blame seller."}
{"rating": 4, "review": "works good"}
{"rating": 4, "review": "Works really well, easy to calibrate. Only knock I have, could no calibrate it using my 4,7,10 solutions. It also comes in a nice protective case, that's a plus as well."}
{"rating": 4, "review": "ok"}
{"rating": 4, "review": "I like the quality of this range hood. When my product came it had broken part behind touch panel, so I contacted seller and they shipped new part right away, got it installed and it works like a charm. Great company to deal with. I also recomened to my brother in law and he got one for himself, also happy with it."}
{"rating": 4, "review": "Works perfectly, still plastic and will probably wear out in a couple years but it gets the job done. Just don't pull out the rack out too hard or put way too much weight on it"}
{"rating": 4, "review": "Good product. I did expect for the bristles to be firmer. The soft bristles make it difficult to catch shorter hair."}
{"rating": 4, "review": "Worked as expected"}
{"rating": 4, "review": "It works good seems to be filtering the water just fine , a little slower than the genuine GE filter, but for half the  price I'll wait the extra couple of seconds it takes to fill my water glass."}
{"rating": 4, "review": "Good"}
{"rating": 4, "review": "Instructions were a bit vague, I would recommend taking pictures, all of them, with your phone before disassembling the old one. Fit well and works perfect."}
{"rating": 4, "review": "Expensive piece of plastic that does exactly what is advertised.  The fits into the opening for the water filter for specific models of GE refrigerators. I got this because my water dispenser stopped working and a technician suggested that a clogged water filter might be the culprit. It wasn't the water filter. If you don't care if you're drinking unfiltered tap water from your fridge then this will save you from having to continually purchase their filters."}
{"rating": 4, "review": "Just put in my oven so too early to write a review - quality appears to be good\nTried to revise/edit and couldn't!!"}
{"rating": 4, "review": "makes nice straight line for proper venting"}
{"rating": 4, "review": "Definitely helps in our ultrasonic humidifier in keeping the white scales down and the misting spray ports open and working.  If one has a humidifier, particularly of the ultrasonic variety, well worth the investment."}
{"rating": 4, "review": "Product was exactly what I needed for my Whirlpool Cabrio. Super easy to install, a lot more challenging removing the old ones. Washer works great now."}
{"rating": 4, "review": "When you take it out of the box, look under nit of this machine. You'll see two little screws on the center. They're both lose. Their purpose is to hold of the shake. If you don't tide them done, they'll become miss thread after the first use, and machine shakes badly. The gentleman on the above video is saying to remove those bolts. I don't know how it will work then. mine got totally broken, and the seller sent me another one and the other one also had lose screws, and I tided them done. I haven't used it yet. just tie them. It's very easy."}
{"rating": 4, "review": "Seams to be a good quality filter."}
{"rating": 5, "review": "Inexpensive. I received within a few days. Very easy to install. Working great. Couldn't be happier. If I need to purchase anything again that this company sells, I will be right back with no hesitation."}
{"rating": 5, "review": "Easy to use and worked great to hold my new door seal on."}
{"rating": 5, "review": "Very easy to install..it's exactly what I needed.."}
{"rating": 5, "review": "I live in a studio size apartment and have had one of these for three years now.  Works great at defeating the static electricity and my cat really appreciates that.  She really hates getting shocked every time I touched her.  I really notice a difference when it's not on.  Perfect fit for me as the easy to fill tanks fit under the kitchen faucet. Runs so quiet, the only way I can tell it's running is when the water in the tanks gurgle periodically.  This will be my fourth winter with it.  Others have died after only two, when the fan motor fails."}
{"rating": 5, "review": "The drain pump is very similar to the original.  It fit perfectly, and after a few wash loads, it is still working great.  For the cost, it is definitely work trying it."}
{"rating": 5, "review": "Direct replacement for the water valve that went bad. Easy enough to replace after watching a few YouTube videos. Glasses now fill at twice the speed they had since we get the refrigerator used."}
{"rating": 5, "review": "Great product. Reasonable price."}
{"rating": 5, "review": "This product arrived quickly and it was easy to put in my stove. Worked perfectly."}
{"rating": 5, "review": "It's doing the job at a fraction of the normal price... what more can I ask!"}
{"rating": 5, "review": "Simple. Cheap. Just what I wanted"}
{"rating": 5, "review": "Works great"}
{"rating": 5, "review": "Good replacement piece. Recommend"}
{"rating": 5, "review": "This product surpassed our highest expectations and has been the best product on the market of its kind!  Gorgeous!  Fab!"}
{"rating": 5, "review": "fit just right"}
{"rating": 5, "review": "This filter is working very well.  I'm very pleased with it and especially with the price, one third the price of those in big box stores."}
{"rating": 5, "review": "Fit perfectly"}
{"rating": 5, "review": "Good quality and easy to install"}
{"rating": 5, "review": "These are perfect for my gas stove! They do not budge and are stylish! I read other reviews on how they were not long enough but these fit PERFECT and I think they will for any standard size stove. Very easy to clean and does the job at keeping the crumbs out. The over hang makes sure nothing gets in the cracks. Wonderful product and customer service is amazing. They wrote me twice just to make sure I loved the item and asked if I had any problems with them. I rarely get a company concerned about making sure the item was everything I wanted/needed it to be! I highly recommend this product!"}
{"rating": 5, "review": "After not being able to use our fridge water line for years because all the other basic filters we used did not seem to work and the water tasted tainted, this was a last resort or we were going to buy a new fridge, the water tastes great now and we will be buying more when needed!"}
{"rating": 5, "review": "Worked as advertised - at far less than the Sears Outlet Store was charging."}
{"rating": 5, "review": "The ice maker was an exact fit for my old one, it fix easily and works great and the price was nice also."}
{"rating": 5, "review": "Great experience with this wine refridgerator so far. Maintains appropriate temperature throughout the fridge. It includes removable racks that will allow you to fit pinot and champagne bottles. Overall, I'm happy with this purchase."}
{"rating": 5, "review": "Great deal love it saves a lot of money !"}
{"rating": 5, "review": "I was happy with this product, quality and price.\nI will buy it again when in need."}
{"rating": 5, "review": "Works great in my Kenmore refrigerator.  Easy to install."}
{"rating": 5, "review": "Was able to finally clear out the lint build up with these items which otherwise will not even come close to reaching with just a vacuum hose.  Good quality build and attaches quite easily to drill."}
{"rating": 5, "review": "Quick 5 minute install and my dryer is like new"}
{"rating": 5, "review": "LOVE it."}
{"rating": 5, "review": "Great price so I ordered two packs so when I need to use the humidifier next year I will have an extra pack to replace the old one."}
{"rating": 5, "review": "Gave this as a gift and they were pleased with the space and ease of installment.  Still works great."}
{"rating": 5, "review": "Easy install.  Very quiet on low! Lighting is better than the old hood by far!  Very stylish and the Wife loves it !"}
{"rating": 5, "review": "This product was to replace a water filter in our Bosch refrigerator.  It was exactly same size/design as the Bosch one at less than a third of Bosch brand.  Water is as clear as before so we are very happy with it and will buy this brand again."}
{"rating": 5, "review": "excellent value"}
{"rating": 5, "review": "Everything that came in this package was in perfect condition, and it all works perfectly.  The product description is vague because it promises \"detailed instruction\".  I assumed this would be assembly instructions, but I did not recieve any.  The only instructions included showed how to adjust the CO2 regulator, a very important thing to know indeed.  Luckily, it doesn't take a lot of brain power to figure out where everything connects, and it all worked out just fine.\nSo . . . everything works, there were not any assembly instructions."}
{"rating": 5, "review": "Great value.  Price is fantastic versus big box appliance store."}
{"rating": 5, "review": "Quick delivery. First one working as expected."}
{"rating": 5, "review": "Works as promised"}
{"rating": 5, "review": "My washer is old but all I needed was a new part & just like new again. On time & the exact part I needed."}
{"rating": 5, "review": "This filter is very easy to put in the ice maker in my refridgerator. I love having this type of filter for my ice maker."}
{"rating": 5, "review": "Fit great and no leaks. Half the price and works just as good as the factory unit."}
{"rating": 5, "review": "Work's great, ordered this with the bearing install kit. followed the supplied instructions had my washer back up and going in just a couple hours."}
{"rating": 5, "review": "prompt shipping, product easy to install."}
{"rating": 5, "review": "Quick fix. Easy to install."}
{"rating": 5, "review": "My wick lasted all winter"}
{"rating": 5, "review": "Well made hoses.  I have a lot of confidence based on the construction these hoses will not fail for many years, if ever.\nHoses are installed and working well."}
{"rating": 5, "review": "Its exactly as the factory makes it.\nFits great, and looks fine.\nIf you need to remove the original, plan\nOn replacing this. The tabs break off"}
{"rating": 5, "review": "Good price and easy to install"}
{"rating": 5, "review": "I do think these cases make a difference, even if it is subtle. First, I'm a bassoonist. Case is nice and big to give tons of room to breathe, stable and sturdy, and the pins are not solid but have channels so air can get in the tube. Reeds seem to be the same day after day. In the early process of making a reed, breaking it in, and letting it stabilize, I think these cases can prevent some of that. Often I open the case in the morning and all of my reeds start immediately crackling like newly formed blanks do. This suggests that they haven't aired out and adjusted or settled in overnight. However once reeds are completely stable and settled (wouldn't crackle as they dry out anymore), I have found this case to prevent warped corners and other strange humidity effects. At the same time, the case is about as expensive (or cheaper) than the basic fox plastic case so you might as well try it. Do be careful that you open the cases at least once a day to be safe - they will mold otherwise, even without the humidity packs in there - they seal air tight. Also, I'd like to be able to choose the humidity pack that comes with a new case, I use the 54%. I use this one because I found that it just keeps the reeds stable, without having them almost soaked. One more caveat with this though is that you will need to bring your water with you. I played an audition where I had put the wet/soaked reed in the case for the ~10 minutes walk around before you play. When I got on stage and pulled the reed out the case had done a wonderful job of drying it out!"}
{"rating": 5, "review": "I have not stop using this wonderful item. It is perfect for my household and it washes clean my clothing."}
{"rating": 5, "review": "Genuine part packaged in a GE-labeled bag.  Was very tight slipping it on, so it feels secure even without the pin.  Works great -- my fan is back in service and much quieter now!"}
{"rating": 5, "review": "Best value on the market"}
{"rating": 5, "review": "exactly what i wanted and expected.  Fit perfect and solved my leak problems.  Thanks guys for providing this great product at such a great price."}
{"rating": 5, "review": "IT IS THE EXACT PRODUCT AS ADVERTISED. FAST SHIPPING AND EASY INSTALLATION.  I WOULD RECOMMEND PURCHASE TO ANYONE IN THE MARKET FOR THIS FILTER"}
{"rating": 5, "review": "Great product. I love it."}
{"rating": 5, "review": "Works perfectly with my Haier 1.5 cubic foot washer"}
{"rating": 5, "review": "great value. quick delivery."}
{"rating": 5, "review": "Work well. Like that they are the Whirlpool brand for our fridge. Function like the factory one the fridge came with."}
{"rating": 5, "review": "100% fit and fix-\nOur LG was noisy and had  smoking during spin. Fit perfectly and now runs smooth and line new"}
{"rating": 5, "review": "Works Great Good Product!"}
{"rating": 5, "review": "So nice! Keeps the oven so much cleaner, and they're easy to clean"}
{"rating": 5, "review": "This range is gorgeous and performs well beyond my expectations! I love the option to choose convection oven or standard bake. The manual that came with it was not extremely helpful, especially on how to correctly operate the probe. Also, I wish that Samsung made it easier to order the back gap kit for replacing a standard range with a slide in. Mine didn't come with it and it's been problematic to order one. BUT...  the range itself is amazing. I love it!"}
{"rating": 5, "review": "worked like it was made for"}
{"rating": 5, "review": "This product is great for cooking rice and preventing it from burning. It distributes the heat perfectly and is particularly great for Persian rice dishes. Shipment was quick and I had no problems with this order."}
{"rating": 5, "review": "This a very good product.  I replaced an old Water Sentinel WSS-1 with a new one and I am very pleased.  These water filters work as well as the original filter that came with my fridge at a much better price.  A five star product in my opinion.  I am also very pleased with the fast and reliable service.  I will order again."}
{"rating": 5, "review": "What can I say.  It's a wick.  It works like a wick.  It's a filter.  It works like a filter.  It's been filtering and wicking for a couple of weeks now.  Seems to filter and wick about as well as the wick filter that's twice the price (and that I've previously used).  I'll be purchasing these again when needed."}
{"rating": 5, "review": "Functionally it seems fine, and the water taste as good as ever. Best deal i have found since owning fridge for several years now."}
{"rating": 5, "review": "Outstanding!!!  Worked like a charm.  15 minute job!!!"}
{"rating": 5, "review": "Glad we went this route rather than have someone come and charge us an arm and leg! Worked out perfectly!"}
{"rating": 5, "review": "Excellent product.  Fit perfectly and water is pure as a mountain stream."}
{"rating": 5, "review": "Easy install.  Saved me hundreds of dollars."}
{"rating": 5, "review": "Works great."}
{"rating": 5, "review": "Right part to replace a leaky hot water washer valve  Best price I found serching the internet. Washer works great now."}
{"rating": 5, "review": "We bought two.  One for our home, another for our cabin.  Both are working great."}
{"rating": 5, "review": "Perfect fit. This was an economical alternative."}
{"rating": 5, "review": "Before buying this range hood I read many of the reviews. There were some complaints about installation and the position of the mounting holes. I had no problems what so ever. It was very easy to install, looks great, and is quiet. The only issue I have with this is installing the halogen light bulbs. There is very little room to grip and twist the bulbs into place. While it was a little frustrating to install the bulbs I am still extremely satisfied with my purchase. I love the look of this fan and after 2 months of use I am really glad I bought it. I felt compelled to write this review because after  reading a few of the other reviews I almost didn't buy this fan. If you like the style of this fan, my recommendation is to buy it."}
{"rating": 5, "review": "Product worked great, received order as promised."}
{"rating": 5, "review": "My 7 year old son LOVES this.  He's been making all kinds of characters and weapons out of this since Christmas.  It's a great alternative for the arty and/or creative boy when the market seems saturated with girl themed and jewelry making products."}
{"rating": 5, "review": "Very easy to install price was excellent"}
{"rating": 5, "review": "good product.  all good.  works great.  easy vendor to deal with.  arrived on time.  good packing"}
{"rating": 5, "review": "Works very well."}
{"rating": 5, "review": "Okay so it has been about 4 months since I got this filter for my Samsung refrigerator and it is still working great. When I first installed it you could tell the difference in the taste of the water and quite honestly it still offers great tasting water."}
{"rating": 5, "review": "came as ordered and on time...perfect fit works great so far"}
{"rating": 5, "review": "Good product fits well in Samsung refrigerator,\nHighly recommended"}
{"rating": 5, "review": "Whatcan I say, works great easy to install!"}
{"rating": 5, "review": "This stacking kit worked perfectly and enabled us to keep our existing washer and dryer by stacking what we have instead of having to buy new!  We are diy'ers and are in the middle of remodeling our small laundry room and wanted to gain some space in there by having a stacking washer and dryer.  Problem was, we like what we already have and it works so it was hard to justify a new purchase.  We were so happy to see that Amazon carries and washer/dryer stacking kit for our washer and dryer model, and for around $30 we figured we'd give it a try.  We are delighted to find that the stacking kit works great and saved us money."}
{"rating": 5, "review": "Super fast shipping and a great product and I couldn't ask for a better price. I put it in my fridge and it worked perfect easy to install"}
{"rating": 5, "review": "Fit perfect, good price"}
{"rating": 5, "review": "Purchased this Refrigerator for a work project. I created a Mothers Nursing room and they needed a refrigerator to store the Milk. It was harder than i thought to find a non glass front refrigerator that does not have a freezer. This one came Easily packaged and fit my needs perfectly. No issues with anything."}
{"rating": 5, "review": "Great Value!"}
{"rating": 5, "review": "Perfect size, very durable"}
{"rating": 5, "review": "Fit my model and works just fine. No issues what so ever!"}
{"rating": 5, "review": "Product came in early, looks just as advertised"}
{"rating": 5, "review": "I purchased this filter for my Vicks V3100 home humidifier. Filters are very easy to change and do the job. I will order it again for sure."}
{"rating": 5, "review": "Worked perfectly. Easy install."}
{"rating": 5, "review": "Received on promise date. Installation was easy. This timer works great. It is the same as the original from the factory."}
{"rating": 5, "review": "Very nice looking.  Just what I wanted."}
{"rating": 5, "review": "As described.  Works and fits just like it should.  I would buy again when needed in future.  Recommended to others as well"}
{"rating": 5, "review": "Nice machine also quick at making ice."}
{"rating": 5, "review": "Used all summer! Love"}
{"rating": 5, "review": "Product looks good, price is amazing.\nI will update after installing it in my fridge"}
{"rating": 5, "review": "Proper part / works fine."}
{"rating": 5, "review": "Easy to install - great customer service"}
{"rating": 5, "review": "Yeah no more leaking from our washing machine :D it arrive early and quickly. Its very easy to change and replace."}
{"rating": 5, "review": "Absolutely wonderful . Does exactly what is advertised and so easy to clean and reuse"}
{"rating": 5, "review": "Worked great"}
{"rating": 5, "review": "It's great, better priced than the GE version"}
{"rating": 5, "review": "Fast shipping, quick to install"}
{"rating": 5, "review": "These washing machine cables were exactly what I expected and llmost half the price of the ones in the hardware store. Great length especially because my connectors are a little far from my machine and I have no worries about getting another leak because my rubber cables burst."}
{"rating": 5, "review": "Work as good as a Samsung.  Much cheaper and fits the same."}
{"rating": 5, "review": "Easy to replace.  Works as expected. Glad to find this item online as it's hard to fin in the store."}
{"rating": 5, "review": "This refrigerator handle totally changed my life! I have a dog now and several girlfriends! If it wasn't for this refrigerator handle I'd be licking old postage stamps trying to get high. I can't say enough about this product! BTW it comes in a set so your freezer can also be super awesome for no additional credits on your thingy thing. Have fun with your junky fridge with handles that break after six months!"}
{"rating": 5, "review": "This stuff saved my dishwasher.  It has not peeled off.  Beats buying a new rack or dishwasher."}
